Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/cam.h
/*
 * Component description for CAM
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2024-07-26T17:56:43Z  */
#ifndef _PIC32CMSG00_CAM_COMPONENT_H_
#define _PIC32CMSG00_CAM_COMPONENT_H_

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR CAM                       */
/* ************************************************************************** */

/* -------- CAM_CTRLA : (CAM Offset: 0x00) (R/W 32) Control Register A -------- */
#define CAM_CTRLA_RESETVALUE                  _UINT32_(0x00)                                       /*  (CAM_CTRLA) Control Register A  Reset Value */

#define CAM_CTRLA_SWRST_Pos                   _UINT32_(0)                                          /* (CAM_CTRLA) Software Reset1 = Reset registers and internal state0 = No effect Position */
#define CAM_CTRLA_SWRST_Msk                   (_UINT32_(0x1) << CAM_CTRLA_SWRST_Pos)               /* (CAM_CTRLA) Software Reset1 = Reset registers and internal state0 = No effect Mask */
#define CAM_CTRLA_SWRST(value)                (CAM_CTRLA_SWRST_Msk & (_UINT32_(value) << CAM_CTRLA_SWRST_Pos)) /* Assignment of value for SWRST in the CAM_CTRLA register */
#define CAM_CTRLA_ENABLE_Pos                  _UINT32_(1)                                          /* (CAM_CTRLA) Macro/Clock Enable bit Position */
#define CAM_CTRLA_ENABLE_Msk                  (_UINT32_(0x1) << CAM_CTRLA_ENABLE_Pos)              /* (CAM_CTRLA) Macro/Clock Enable bit Mask */
#define CAM_CTRLA_ENABLE(value)               (CAM_CTRLA_ENABLE_Msk & (_UINT32_(value) << CAM_CTRLA_ENABLE_Pos)) /* Assignment of value for ENABLE in the CAM_CTRLA register */
#define   CAM_CTRLA_ENABLE_0_Val              _UINT32_(0x0)                                        /* (CAM_CTRLA) CAM clock is not requested and macros is disabled.  */
#define   CAM_CTRLA_ENABLE_1_Val              _UINT32_(0x1)                                        /* (CAM_CTRLA) CAM clock is requested and macro is enabled.  */
#define CAM_CTRLA_ENABLE_0                    (CAM_CTRLA_ENABLE_0_Val << CAM_CTRLA_ENABLE_Pos)     /* (CAM_CTRLA) CAM clock is not requested and macros is disabled. Position */
#define CAM_CTRLA_ENABLE_1                    (CAM_CTRLA_ENABLE_1_Val << CAM_CTRLA_ENABLE_Pos)     /* (CAM_CTRLA) CAM clock is requested and macro is enabled. Position */
#define CAM_CTRLA_PRIV_Pos                    _UINT32_(2)                                          /* (CAM_CTRLA) Privileged Access Only - This bit affects all Wrapper and EIP registers. Position */
#define CAM_CTRLA_PRIV_Msk                    (_UINT32_(0x1) << CAM_CTRLA_PRIV_Pos)                /* (CAM_CTRLA) Privileged Access Only - This bit affects all Wrapper and EIP registers. Mask */
#define CAM_CTRLA_PRIV(value)                 (CAM_CTRLA_PRIV_Msk & (_UINT32_(value) << CAM_CTRLA_PRIV_Pos)) /* Assignment of value for PRIV in the CAM_CTRLA register */
#define   CAM_CTRLA_PRIV_0_Val                _UINT32_(0x0)                                        /* (CAM_CTRLA) CAM registers accessible in privileged and unprivileged modes. Master Requests are NOT privileged  */
#define   CAM_CTRLA_PRIV_1_Val                _UINT32_(0x1)                                        /* (CAM_CTRLA) CAM registers only accessible in privileged mode.  Master Requests are also privileged.  */
#define CAM_CTRLA_PRIV_0                      (CAM_CTRLA_PRIV_0_Val << CAM_CTRLA_PRIV_Pos)         /* (CAM_CTRLA) CAM registers accessible in privileged and unprivileged modes. Master Requests are NOT privileged Position */
#define CAM_CTRLA_PRIV_1                      (CAM_CTRLA_PRIV_1_Val << CAM_CTRLA_PRIV_Pos)         /* (CAM_CTRLA) CAM registers only accessible in privileged mode.  Master Requests are also privileged. Position */
#define CAM_CTRLA_RUNSTDBY_Pos                _UINT32_(6)                                          /* (CAM_CTRLA) Run In Standby bit Position */
#define CAM_CTRLA_RUNSTDBY_Msk                (_UINT32_(0x1) << CAM_CTRLA_RUNSTDBY_Pos)            /* (CAM_CTRLA) Run In Standby bit Mask */
#define CAM_CTRLA_RUNSTDBY(value)             (CAM_CTRLA_RUNSTDBY_Msk & (_UINT32_(value) << CAM_CTRLA_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the CAM_CTRLA register */
#define   CAM_CTRLA_RUNSTDBY_0_Val            _UINT32_(0x0)                                        /* (CAM_CTRLA) CAM clock is disabled in Standby Sleep mode, clock requests are de-asserted after any pending bus transactions or requests are completed.  */
#define   CAM_CTRLA_RUNSTDBY_1_Val            _UINT32_(0x1)                                        /* (CAM_CTRLA) If enabled, the CAM clock remains requested in Standby Sleep mode.  */
#define CAM_CTRLA_RUNSTDBY_0                  (CAM_CTRLA_RUNSTDBY_0_Val << CAM_CTRLA_RUNSTDBY_Pos) /* (CAM_CTRLA) CAM clock is disabled in Standby Sleep mode, clock requests are de-asserted after any pending bus transactions or requests are completed. Position */
#define CAM_CTRLA_RUNSTDBY_1                  (CAM_CTRLA_RUNSTDBY_1_Val << CAM_CTRLA_RUNSTDBY_Pos) /* (CAM_CTRLA) If enabled, the CAM clock remains requested in Standby Sleep mode. Position */
#define CAM_CTRLA_Msk                         _UINT32_(0x00000047)                                 /* (CAM_CTRLA) Register Mask  */


/* -------- CAM_STATUSA : (CAM Offset: 0x38) ( R/ 32) STATUS Register A -------- */
#define CAM_STATUSA_RESETVALUE                _UINT32_(0x00)                                       /*  (CAM_STATUSA) STATUS Register A  Reset Value */

#define CAM_STATUSA_OTPLOCK_Pos               _UINT32_(0)                                          /* (CAM_STATUSA) OTP Lock bit Position */
#define CAM_STATUSA_OTPLOCK_Msk               (_UINT32_(0x1) << CAM_STATUSA_OTPLOCK_Pos)           /* (CAM_STATUSA) OTP Lock bit Mask */
#define CAM_STATUSA_OTPLOCK(value)            (CAM_STATUSA_OTPLOCK_Msk & (_UINT32_(value) << CAM_STATUSA_OTPLOCK_Pos)) /* Assignment of value for OTPLOCK in the CAM_STATUSA register */
#define   CAM_STATUSA_OTPLOCK_1_Val           _UINT32_(0x1)                                        /* (CAM_STATUSA) OTP lock bit set. Device not in IC manufacturing.  */
#define CAM_STATUSA_OTPLOCK_1                 (CAM_STATUSA_OTPLOCK_1_Val << CAM_STATUSA_OTPLOCK_Pos) /* (CAM_STATUSA) OTP lock bit set. Device not in IC manufacturing. Position */
#define CAM_STATUSA_Msk                       _UINT32_(0x00000001)                                 /* (CAM_STATUSA) Register Mask  */


