Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/cam.h
/* -------- CAM_SYNCBUSY : (CAM Offset: 0x5C) ( R/ 32) SYNCBUSY Register -------- */
#define CAM_SYNCBUSY_RESETVALUE               _UINT32_(0x00)                                       /*  (CAM_SYNCBUSY) SYNCBUSY Register  Reset Value */

#define CAM_SYNCBUSY_SWRST_Pos                _UINT32_(0)                                          /* (CAM_SYNCBUSY) Software Reset Synchronization Busy1 = SWRST synchronization is busy0 = SWRST synchronization is NOT busy Position */
#define CAM_SYNCBUSY_SWRST_Msk                (_UINT32_(0x1) << CAM_SYNCBUSY_SWRST_Pos)            /* (CAM_SYNCBUSY) Software Reset Synchronization Busy1 = SWRST synchronization is busy0 = SWRST synchronization is NOT busy Mask */
#define CAM_SYNCBUSY_SWRST(value)             (CAM_SYNCBUSY_SWRST_Msk & (_UINT32_(value) << CAM_SYNCBUSY_SWRST_Pos)) /* Assignment of value for SWRST in the CAM_SYNCBUSY register */
#define CAM_SYNCBUSY_ENABLE_Pos               _UINT32_(1)                                          /* (CAM_SYNCBUSY) Macro Enable Synchronization Busy Position */
#define CAM_SYNCBUSY_ENABLE_Msk               (_UINT32_(0x1) << CAM_SYNCBUSY_ENABLE_Pos)           /* (CAM_SYNCBUSY) Macro Enable Synchronization Busy Mask */
#define CAM_SYNCBUSY_ENABLE(value)            (CAM_SYNCBUSY_ENABLE_Msk & (_UINT32_(value) << CAM_SYNCBUSY_ENABLE_Pos)) /* Assignment of value for ENABLE in the CAM_SYNCBUSY register */
#define   CAM_SYNCBUSY_ENABLE_0_Val           _UINT32_(0x0)                                        /* (CAM_SYNCBUSY) ENABLE synchronization is NOT busy.  */
#define   CAM_SYNCBUSY_ENABLE_1_Val           _UINT32_(0x1)                                        /* (CAM_SYNCBUSY) ENABLE synchronization is busy.  */
#define CAM_SYNCBUSY_ENABLE_0                 (CAM_SYNCBUSY_ENABLE_0_Val << CAM_SYNCBUSY_ENABLE_Pos) /* (CAM_SYNCBUSY) ENABLE synchronization is NOT busy. Position */
#define CAM_SYNCBUSY_ENABLE_1                 (CAM_SYNCBUSY_ENABLE_1_Val << CAM_SYNCBUSY_ENABLE_Pos) /* (CAM_SYNCBUSY) ENABLE synchronization is busy. Position */
#define CAM_SYNCBUSY_Msk                      _UINT32_(0x00000003)                                 /* (CAM_SYNCBUSY) Register Mask  */


/* -------- CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_LSB : (CAM Offset: 0x10000) (R/W 32)  -------- */
#define CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_LSB_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_LSB)   Reset Value */

#define CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_LSB_FETCH_ADDR_LSB_Pos _UINT32_(0)                                          /* (CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_LSB)  Position */
#define CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_LSB_FETCH_ADDR_LSB_Msk (_UINT32_(0xFFFFFFFF) << CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_LSB_FETCH_ADDR_LSB_Pos) /* (CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_LSB)  Mask */
#define CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_LSB_FETCH_ADDR_LSB(value) (CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_LSB_FETCH_ADDR_LSB_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_LSB_FETCH_ADDR_LSB_Pos)) /* Assignment of value for FETCH_ADDR_LSB in the CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_LSB register */
#define CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_LSB_Msk _UINT32_(0xFFFFFFFF)                                 /* (CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_LSB) Register Mask  */


/* -------- CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_MSB : (CAM Offset: 0x10004) (R/W 32)  -------- */
#define CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_MSB_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_MSB)   Reset Value */

#define CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_MSB_FETCH_ADDR_MSB_Pos _UINT32_(0)                                          /* (CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_MSB)  Position */
#define CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_MSB_FETCH_ADDR_MSB_Msk (_UINT32_(0xFFFFFFFF) << CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_MSB_FETCH_ADDR_MSB_Pos) /* (CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_MSB)  Mask */
#define CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_MSB_FETCH_ADDR_MSB(value) (CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_MSB_FETCH_ADDR_MSB_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_MSB_FETCH_ADDR_MSB_Pos)) /* Assignment of value for FETCH_ADDR_MSB in the CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_MSB register */
#define CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_MSB_Msk _UINT32_(0xFFFFFFFF)                                 /* (CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_MSB) Register Mask  */


/* -------- CAM_CryptoMaster_DMA_Registers__FETCH_LEN : (CAM Offset: 0x10008) (R/W 32)  -------- */
#define CAM_CryptoMaster_DMA_Registers__FETCH_LEN_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_CryptoMaster_DMA_Registers__FETCH_LEN)   Reset Value */

#define CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_LEN_Pos _UINT32_(0)                                          /* (CAM_CryptoMaster_DMA_Registers__FETCH_LEN)  Position */
#define CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_LEN_Msk (_UINT32_(0xFFFFFFF) << CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_LEN_Pos) /* (CAM_CryptoMaster_DMA_Registers__FETCH_LEN)  Mask */
#define CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_LEN(value) (CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_LEN_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_LEN_Pos)) /* Assignment of value for FETCH_LEN in the CAM_CryptoMaster_DMA_Registers__FETCH_LEN register */
#define CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_CSTADDR_Pos _UINT32_(28)                                         /* (CAM_CryptoMaster_DMA_Registers__FETCH_LEN)  Position */
#define CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_CSTADDR_Msk (_UINT32_(0x1) << CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_CSTADDR_Pos) /* (CAM_CryptoMaster_DMA_Registers__FETCH_LEN)  Mask */
#define CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_CSTADDR(value) (CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_CSTADDR_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_CSTADDR_Pos)) /* Assignment of value for FETCH_CSTADDR in the CAM_CryptoMaster_DMA_Registers__FETCH_LEN register */
#define CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_REALIGN_Pos _UINT32_(29)                                         /* (CAM_CryptoMaster_DMA_Registers__FETCH_LEN)  Position */
#define CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_REALIGN_Msk (_UINT32_(0x1) << CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_REALIGN_Pos) /* (CAM_CryptoMaster_DMA_Registers__FETCH_LEN)  Mask */
#define CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_REALIGN(value) (CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_REALIGN_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_REALIGN_Pos)) /* Assignment of value for FETCH_REALIGN in the CAM_CryptoMaster_DMA_Registers__FETCH_LEN register */
#define CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_ZPADDING_Pos _UINT32_(30)                                         /* (CAM_CryptoMaster_DMA_Registers__FETCH_LEN)  Position */
#define CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_ZPADDING_Msk (_UINT32_(0x1) << CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_ZPADDING_Pos) /* (CAM_CryptoMaster_DMA_Registers__FETCH_LEN)  Mask */
#define CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_ZPADDING(value) (CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_ZPADDING_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__FETCH_LEN_FETCH_ZPADDING_Pos)) /* Assignment of value for FETCH_ZPADDING in the CAM_CryptoMaster_DMA_Registers__FETCH_LEN register */
#define CAM_CryptoMaster_DMA_Registers__FETCH_LEN_Msk _UINT32_(0x7FFFFFFF)                                 /* (CAM_CryptoMaster_DMA_Registers__FETCH_LEN) Register Mask  */


/* -------- CAM_CryptoMaster_DMA_Registers__FETCH_TAG : (CAM Offset: 0x1000C) (R/W 32)  -------- */
#define CAM_CryptoMaster_DMA_Registers__FETCH_TAG_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_CryptoMaster_DMA_Registers__FETCH_TAG)   Reset Value */

#define CAM_CryptoMaster_DMA_Registers__FETCH_TAG_FETCH_TAG_Pos _UINT32_(0)                                          /* (CAM_CryptoMaster_DMA_Registers__FETCH_TAG)  Position */
#define CAM_CryptoMaster_DMA_Registers__FETCH_TAG_FETCH_TAG_Msk (_UINT32_(0xFFFFFFFF) << CAM_CryptoMaster_DMA_Registers__FETCH_TAG_FETCH_TAG_Pos) /* (CAM_CryptoMaster_DMA_Registers__FETCH_TAG)  Mask */
#define CAM_CryptoMaster_DMA_Registers__FETCH_TAG_FETCH_TAG(value) (CAM_CryptoMaster_DMA_Registers__FETCH_TAG_FETCH_TAG_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__FETCH_TAG_FETCH_TAG_Pos)) /* Assignment of value for FETCH_TAG in the CAM_CryptoMaster_DMA_Registers__FETCH_TAG register */
#define CAM_CryptoMaster_DMA_Registers__FETCH_TAG_Msk _UINT32_(0xFFFFFFFF)                                 /* (CAM_CryptoMaster_DMA_Registers__FETCH_TAG) Register Mask  */


/* -------- CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB : (CAM Offset: 0x10010) (R/W 32)  -------- */
#define CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB)   Reset Value */

