Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/cam.h
#define CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB_PUSH_ADDR_LSB_Pos _UINT32_(0)                                          /* (CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB)  Position */
#define CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB_PUSH_ADDR_LSB_Msk (_UINT32_(0xFFFFFFFF) << CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB_PUSH_ADDR_LSB_Pos) /* (CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB)  Mask */
#define CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB_PUSH_ADDR_LSB(value) (CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB_PUSH_ADDR_LSB_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB_PUSH_ADDR_LSB_Pos)) /* Assignment of value for PUSH_ADDR_LSB in the CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB register */
#define CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB_Msk _UINT32_(0xFFFFFFFF)                                 /* (CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB) Register Mask  */


/* -------- CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB : (CAM Offset: 0x10014) (R/W 32)  -------- */
#define CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB)   Reset Value */

#define CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB_PUSH_ADDR_MSB_Pos _UINT32_(0)                                          /* (CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB)  Position */
#define CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB_PUSH_ADDR_MSB_Msk (_UINT32_(0xFFFFFFFF) << CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB_PUSH_ADDR_MSB_Pos) /* (CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB)  Mask */
#define CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB_PUSH_ADDR_MSB(value) (CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB_PUSH_ADDR_MSB_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB_PUSH_ADDR_MSB_Pos)) /* Assignment of value for PUSH_ADDR_MSB in the CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB register */
#define CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB_Msk _UINT32_(0xFFFFFFFF)                                 /* (CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB) Register Mask  */


/* -------- CAM_CryptoMaster_DMA_Registers__PUSH_LEN : (CAM Offset: 0x10018) (R/W 32)  -------- */
#define CAM_CryptoMaster_DMA_Registers__PUSH_LEN_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_CryptoMaster_DMA_Registers__PUSH_LEN)   Reset Value */

#define CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_LEN_Pos _UINT32_(0)                                          /* (CAM_CryptoMaster_DMA_Registers__PUSH_LEN)  Position */
#define CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_LEN_Msk (_UINT32_(0xFFFFFFF) << CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_LEN_Pos) /* (CAM_CryptoMaster_DMA_Registers__PUSH_LEN)  Mask */
#define CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_LEN(value) (CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_LEN_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_LEN_Pos)) /* Assignment of value for PUSH_LEN in the CAM_CryptoMaster_DMA_Registers__PUSH_LEN register */
#define CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_CSTADDR_Pos _UINT32_(28)                                         /* (CAM_CryptoMaster_DMA_Registers__PUSH_LEN)  Position */
#define CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_CSTADDR_Msk (_UINT32_(0x1) << CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_CSTADDR_Pos) /* (CAM_CryptoMaster_DMA_Registers__PUSH_LEN)  Mask */
#define CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_CSTADDR(value) (CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_CSTADDR_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_CSTADDR_Pos)) /* Assignment of value for PUSH_CSTADDR in the CAM_CryptoMaster_DMA_Registers__PUSH_LEN register */
#define CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_REALIGN_Pos _UINT32_(29)                                         /* (CAM_CryptoMaster_DMA_Registers__PUSH_LEN)  Position */
#define CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_REALIGN_Msk (_UINT32_(0x1) << CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_REALIGN_Pos) /* (CAM_CryptoMaster_DMA_Registers__PUSH_LEN)  Mask */
#define CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_REALIGN(value) (CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_REALIGN_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_REALIGN_Pos)) /* Assignment of value for PUSH_REALIGN in the CAM_CryptoMaster_DMA_Registers__PUSH_LEN register */
#define CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_DISCARD_Pos _UINT32_(30)                                         /* (CAM_CryptoMaster_DMA_Registers__PUSH_LEN)  Position */
#define CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_DISCARD_Msk (_UINT32_(0x1) << CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_DISCARD_Pos) /* (CAM_CryptoMaster_DMA_Registers__PUSH_LEN)  Mask */
#define CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_DISCARD(value) (CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_DISCARD_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__PUSH_LEN_PUSH_DISCARD_Pos)) /* Assignment of value for PUSH_DISCARD in the CAM_CryptoMaster_DMA_Registers__PUSH_LEN register */
#define CAM_CryptoMaster_DMA_Registers__PUSH_LEN_Msk _UINT32_(0x7FFFFFFF)                                 /* (CAM_CryptoMaster_DMA_Registers__PUSH_LEN) Register Mask  */


/* -------- CAM_CryptoMaster_DMA_Registers__INT_EN : (CAM Offset: 0x1001C) (R/W 32)  -------- */
#define CAM_CryptoMaster_DMA_Registers__INT_EN_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_CryptoMaster_DMA_Registers__INT_EN)   Reset Value */

#define CAM_CryptoMaster_DMA_Registers__INT_EN_INT_EN_Pos _UINT32_(0)                                          /* (CAM_CryptoMaster_DMA_Registers__INT_EN)  Position */
#define CAM_CryptoMaster_DMA_Registers__INT_EN_INT_EN_Msk (_UINT32_(0x3F) << CAM_CryptoMaster_DMA_Registers__INT_EN_INT_EN_Pos) /* (CAM_CryptoMaster_DMA_Registers__INT_EN)  Mask */
#define CAM_CryptoMaster_DMA_Registers__INT_EN_INT_EN(value) (CAM_CryptoMaster_DMA_Registers__INT_EN_INT_EN_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__INT_EN_INT_EN_Pos)) /* Assignment of value for INT_EN in the CAM_CryptoMaster_DMA_Registers__INT_EN register */
#define CAM_CryptoMaster_DMA_Registers__INT_EN_Msk _UINT32_(0x0000003F)                                 /* (CAM_CryptoMaster_DMA_Registers__INT_EN) Register Mask  */


