Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/cam.h
/* -------- CAM_CryptoMaster_DMA_Registers__INT_ENSET : (CAM Offset: 0x10020) ( /W 32)  -------- */
#define CAM_CryptoMaster_DMA_Registers__INT_ENSET_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_CryptoMaster_DMA_Registers__INT_ENSET)   Reset Value */

#define CAM_CryptoMaster_DMA_Registers__INT_ENSET_INT_ENSET_Pos _UINT32_(0)                                          /* (CAM_CryptoMaster_DMA_Registers__INT_ENSET)  Position */
#define CAM_CryptoMaster_DMA_Registers__INT_ENSET_INT_ENSET_Msk (_UINT32_(0x3F) << CAM_CryptoMaster_DMA_Registers__INT_ENSET_INT_ENSET_Pos) /* (CAM_CryptoMaster_DMA_Registers__INT_ENSET)  Mask */
#define CAM_CryptoMaster_DMA_Registers__INT_ENSET_INT_ENSET(value) (CAM_CryptoMaster_DMA_Registers__INT_ENSET_INT_ENSET_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__INT_ENSET_INT_ENSET_Pos)) /* Assignment of value for INT_ENSET in the CAM_CryptoMaster_DMA_Registers__INT_ENSET register */
#define CAM_CryptoMaster_DMA_Registers__INT_ENSET_Msk _UINT32_(0x0000003F)                                 /* (CAM_CryptoMaster_DMA_Registers__INT_ENSET) Register Mask  */


/* -------- CAM_CryptoMaster_DMA_Registers__INT_ENCLR : (CAM Offset: 0x10024) ( /W 32)  -------- */
#define CAM_CryptoMaster_DMA_Registers__INT_ENCLR_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_CryptoMaster_DMA_Registers__INT_ENCLR)   Reset Value */

#define CAM_CryptoMaster_DMA_Registers__INT_ENCLR_INT_ENCLR_Pos _UINT32_(0)                                          /* (CAM_CryptoMaster_DMA_Registers__INT_ENCLR)  Position */
#define CAM_CryptoMaster_DMA_Registers__INT_ENCLR_INT_ENCLR_Msk (_UINT32_(0x3F) << CAM_CryptoMaster_DMA_Registers__INT_ENCLR_INT_ENCLR_Pos) /* (CAM_CryptoMaster_DMA_Registers__INT_ENCLR)  Mask */
#define CAM_CryptoMaster_DMA_Registers__INT_ENCLR_INT_ENCLR(value) (CAM_CryptoMaster_DMA_Registers__INT_ENCLR_INT_ENCLR_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__INT_ENCLR_INT_ENCLR_Pos)) /* Assignment of value for INT_ENCLR in the CAM_CryptoMaster_DMA_Registers__INT_ENCLR register */
#define CAM_CryptoMaster_DMA_Registers__INT_ENCLR_Msk _UINT32_(0x0000003F)                                 /* (CAM_CryptoMaster_DMA_Registers__INT_ENCLR) Register Mask  */


/* -------- CAM_CryptoMaster_DMA_Registers__INT_STATRAW : (CAM Offset: 0x10028) ( R/ 32)  -------- */
#define CAM_CryptoMaster_DMA_Registers__INT_STATRAW_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_CryptoMaster_DMA_Registers__INT_STATRAW)   Reset Value */

#define CAM_CryptoMaster_DMA_Registers__INT_STATRAW_INT_STATRAW_Pos _UINT32_(0)                                          /* (CAM_CryptoMaster_DMA_Registers__INT_STATRAW)  Position */
#define CAM_CryptoMaster_DMA_Registers__INT_STATRAW_INT_STATRAW_Msk (_UINT32_(0x3F) << CAM_CryptoMaster_DMA_Registers__INT_STATRAW_INT_STATRAW_Pos) /* (CAM_CryptoMaster_DMA_Registers__INT_STATRAW)  Mask */
#define CAM_CryptoMaster_DMA_Registers__INT_STATRAW_INT_STATRAW(value) (CAM_CryptoMaster_DMA_Registers__INT_STATRAW_INT_STATRAW_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__INT_STATRAW_INT_STATRAW_Pos)) /* Assignment of value for INT_STATRAW in the CAM_CryptoMaster_DMA_Registers__INT_STATRAW register */
#define CAM_CryptoMaster_DMA_Registers__INT_STATRAW_Msk _UINT32_(0x0000003F)                                 /* (CAM_CryptoMaster_DMA_Registers__INT_STATRAW) Register Mask  */


/* -------- CAM_CryptoMaster_DMA_Registers__INT_STAT : (CAM Offset: 0x1002C) ( R/ 32)  -------- */
#define CAM_CryptoMaster_DMA_Registers__INT_STAT_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_CryptoMaster_DMA_Registers__INT_STAT)   Reset Value */

#define CAM_CryptoMaster_DMA_Registers__INT_STAT_INT_STAT_Pos _UINT32_(0)                                          /* (CAM_CryptoMaster_DMA_Registers__INT_STAT)  Position */
#define CAM_CryptoMaster_DMA_Registers__INT_STAT_INT_STAT_Msk (_UINT32_(0x3F) << CAM_CryptoMaster_DMA_Registers__INT_STAT_INT_STAT_Pos) /* (CAM_CryptoMaster_DMA_Registers__INT_STAT)  Mask */
#define CAM_CryptoMaster_DMA_Registers__INT_STAT_INT_STAT(value) (CAM_CryptoMaster_DMA_Registers__INT_STAT_INT_STAT_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__INT_STAT_INT_STAT_Pos)) /* Assignment of value for INT_STAT in the CAM_CryptoMaster_DMA_Registers__INT_STAT register */
#define CAM_CryptoMaster_DMA_Registers__INT_STAT_Msk _UINT32_(0x0000003F)                                 /* (CAM_CryptoMaster_DMA_Registers__INT_STAT) Register Mask  */


/* -------- CAM_CryptoMaster_DMA_Registers__INT_STATCLR : (CAM Offset: 0x10030) ( /W 32)  -------- */
#define CAM_CryptoMaster_DMA_Registers__INT_STATCLR_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_CryptoMaster_DMA_Registers__INT_STATCLR)   Reset Value */

#define CAM_CryptoMaster_DMA_Registers__INT_STATCLR_INT_STATCLR_Pos _UINT32_(0)                                          /* (CAM_CryptoMaster_DMA_Registers__INT_STATCLR)  Position */
#define CAM_CryptoMaster_DMA_Registers__INT_STATCLR_INT_STATCLR_Msk (_UINT32_(0x3F) << CAM_CryptoMaster_DMA_Registers__INT_STATCLR_INT_STATCLR_Pos) /* (CAM_CryptoMaster_DMA_Registers__INT_STATCLR)  Mask */
#define CAM_CryptoMaster_DMA_Registers__INT_STATCLR_INT_STATCLR(value) (CAM_CryptoMaster_DMA_Registers__INT_STATCLR_INT_STATCLR_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__INT_STATCLR_INT_STATCLR_Pos)) /* Assignment of value for INT_STATCLR in the CAM_CryptoMaster_DMA_Registers__INT_STATCLR register */
#define CAM_CryptoMaster_DMA_Registers__INT_STATCLR_Msk _UINT32_(0x0000003F)                                 /* (CAM_CryptoMaster_DMA_Registers__INT_STATCLR) Register Mask  */


/* -------- CAM_CryptoMaster_DMA_Registers__CONFIG : (CAM Offset: 0x10034) (R/W 32)  -------- */
#define CAM_CryptoMaster_DMA_Registers__CONFIG_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_CryptoMaster_DMA_Registers__CONFIG)   Reset Value */

#define CAM_CryptoMaster_DMA_Registers__CONFIG_FETCH_CTRL_INDIRECT_Pos _UINT32_(0)                                          /* (CAM_CryptoMaster_DMA_Registers__CONFIG)  Position */
#define CAM_CryptoMaster_DMA_Registers__CONFIG_FETCH_CTRL_INDIRECT_Msk (_UINT32_(0x1) << CAM_CryptoMaster_DMA_Registers__CONFIG_FETCH_CTRL_INDIRECT_Pos) /* (CAM_CryptoMaster_DMA_Registers__CONFIG)  Mask */
#define CAM_CryptoMaster_DMA_Registers__CONFIG_FETCH_CTRL_INDIRECT(value) (CAM_CryptoMaster_DMA_Registers__CONFIG_FETCH_CTRL_INDIRECT_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__CONFIG_FETCH_CTRL_INDIRECT_Pos)) /* Assignment of value for FETCH_CTRL_INDIRECT in the CAM_CryptoMaster_DMA_Registers__CONFIG register */
#define CAM_CryptoMaster_DMA_Registers__CONFIG_PUSH_CTRL_INDIRECT_Pos _UINT32_(1)                                          /* (CAM_CryptoMaster_DMA_Registers__CONFIG)  Position */
#define CAM_CryptoMaster_DMA_Registers__CONFIG_PUSH_CTRL_INDIRECT_Msk (_UINT32_(0x1) << CAM_CryptoMaster_DMA_Registers__CONFIG_PUSH_CTRL_INDIRECT_Pos) /* (CAM_CryptoMaster_DMA_Registers__CONFIG)  Mask */
#define CAM_CryptoMaster_DMA_Registers__CONFIG_PUSH_CTRL_INDIRECT(value) (CAM_CryptoMaster_DMA_Registers__CONFIG_PUSH_CTRL_INDIRECT_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__CONFIG_PUSH_CTRL_INDIRECT_Pos)) /* Assignment of value for PUSH_CTRL_INDIRECT in the CAM_CryptoMaster_DMA_Registers__CONFIG register */
#define CAM_CryptoMaster_DMA_Registers__CONFIG_FETCH_STOP_Pos _UINT32_(2)                                          /* (CAM_CryptoMaster_DMA_Registers__CONFIG)  Position */
#define CAM_CryptoMaster_DMA_Registers__CONFIG_FETCH_STOP_Msk (_UINT32_(0x1) << CAM_CryptoMaster_DMA_Registers__CONFIG_FETCH_STOP_Pos) /* (CAM_CryptoMaster_DMA_Registers__CONFIG)  Mask */
#define CAM_CryptoMaster_DMA_Registers__CONFIG_FETCH_STOP(value) (CAM_CryptoMaster_DMA_Registers__CONFIG_FETCH_STOP_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__CONFIG_FETCH_STOP_Pos)) /* Assignment of value for FETCH_STOP in the CAM_CryptoMaster_DMA_Registers__CONFIG register */
#define CAM_CryptoMaster_DMA_Registers__CONFIG_PUSH_STOP_Pos _UINT32_(3)                                          /* (CAM_CryptoMaster_DMA_Registers__CONFIG)  Position */
#define CAM_CryptoMaster_DMA_Registers__CONFIG_PUSH_STOP_Msk (_UINT32_(0x1) << CAM_CryptoMaster_DMA_Registers__CONFIG_PUSH_STOP_Pos) /* (CAM_CryptoMaster_DMA_Registers__CONFIG)  Mask */
#define CAM_CryptoMaster_DMA_Registers__CONFIG_PUSH_STOP(value) (CAM_CryptoMaster_DMA_Registers__CONFIG_PUSH_STOP_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__CONFIG_PUSH_STOP_Pos)) /* Assignment of value for PUSH_STOP in the CAM_CryptoMaster_DMA_Registers__CONFIG register */
#define CAM_CryptoMaster_DMA_Registers__CONFIG_SOFT_RST_Pos _UINT32_(4)                                          /* (CAM_CryptoMaster_DMA_Registers__CONFIG)  Position */
#define CAM_CryptoMaster_DMA_Registers__CONFIG_SOFT_RST_Msk (_UINT32_(0x1) << CAM_CryptoMaster_DMA_Registers__CONFIG_SOFT_RST_Pos) /* (CAM_CryptoMaster_DMA_Registers__CONFIG)  Mask */
#define CAM_CryptoMaster_DMA_Registers__CONFIG_SOFT_RST(value) (CAM_CryptoMaster_DMA_Registers__CONFIG_SOFT_RST_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__CONFIG_SOFT_RST_Pos)) /* Assignment of value for SOFT_RST in the CAM_CryptoMaster_DMA_Registers__CONFIG register */
#define CAM_CryptoMaster_DMA_Registers__CONFIG_Msk _UINT32_(0x0000001F)                                 /* (CAM_CryptoMaster_DMA_Registers__CONFIG) Register Mask  */


/* -------- CAM_CryptoMaster_DMA_Registers__START : (CAM Offset: 0x10038) ( /W 32)  -------- */
#define CAM_CryptoMaster_DMA_Registers__START_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_CryptoMaster_DMA_Registers__START)   Reset Value */

#define CAM_CryptoMaster_DMA_Registers__START_START_FETCH_Pos _UINT32_(0)                                          /* (CAM_CryptoMaster_DMA_Registers__START)  Position */
#define CAM_CryptoMaster_DMA_Registers__START_START_FETCH_Msk (_UINT32_(0x1) << CAM_CryptoMaster_DMA_Registers__START_START_FETCH_Pos) /* (CAM_CryptoMaster_DMA_Registers__START)  Mask */
#define CAM_CryptoMaster_DMA_Registers__START_START_FETCH(value) (CAM_CryptoMaster_DMA_Registers__START_START_FETCH_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__START_START_FETCH_Pos)) /* Assignment of value for START_FETCH in the CAM_CryptoMaster_DMA_Registers__START register */
#define CAM_CryptoMaster_DMA_Registers__START_START_PUSH_Pos _UINT32_(1)                                          /* (CAM_CryptoMaster_DMA_Registers__START)  Position */
#define CAM_CryptoMaster_DMA_Registers__START_START_PUSH_Msk (_UINT32_(0x1) << CAM_CryptoMaster_DMA_Registers__START_START_PUSH_Pos) /* (CAM_CryptoMaster_DMA_Registers__START)  Mask */
#define CAM_CryptoMaster_DMA_Registers__START_START_PUSH(value) (CAM_CryptoMaster_DMA_Registers__START_START_PUSH_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__START_START_PUSH_Pos)) /* Assignment of value for START_PUSH in the CAM_CryptoMaster_DMA_Registers__START register */
#define CAM_CryptoMaster_DMA_Registers__START_Msk _UINT32_(0x00000003)                                 /* (CAM_CryptoMaster_DMA_Registers__START) Register Mask  */


/* -------- CAM_CryptoMaster_DMA_Registers__STATUS : (CAM Offset: 0x1003C) ( R/ 32)  -------- */
#define CAM_CryptoMaster_DMA_Registers__STATUS_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_CryptoMaster_DMA_Registers__STATUS)   Reset Value */

#define CAM_CryptoMaster_DMA_Registers__STATUS_FETCH_BUSY_Pos _UINT32_(0)                                          /* (CAM_CryptoMaster_DMA_Registers__STATUS)  Position */
#define CAM_CryptoMaster_DMA_Registers__STATUS_FETCH_BUSY_Msk (_UINT32_(0x1) << CAM_CryptoMaster_DMA_Registers__STATUS_FETCH_BUSY_Pos) /* (CAM_CryptoMaster_DMA_Registers__STATUS)  Mask */
#define CAM_CryptoMaster_DMA_Registers__STATUS_FETCH_BUSY(value) (CAM_CryptoMaster_DMA_Registers__STATUS_FETCH_BUSY_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__STATUS_FETCH_BUSY_Pos)) /* Assignment of value for FETCH_BUSY in the CAM_CryptoMaster_DMA_Registers__STATUS register */
#define CAM_CryptoMaster_DMA_Registers__STATUS_PUSH_BUSY_Pos _UINT32_(1)                                          /* (CAM_CryptoMaster_DMA_Registers__STATUS)  Position */
#define CAM_CryptoMaster_DMA_Registers__STATUS_PUSH_BUSY_Msk (_UINT32_(0x1) << CAM_CryptoMaster_DMA_Registers__STATUS_PUSH_BUSY_Pos) /* (CAM_CryptoMaster_DMA_Registers__STATUS)  Mask */
#define CAM_CryptoMaster_DMA_Registers__STATUS_PUSH_BUSY(value) (CAM_CryptoMaster_DMA_Registers__STATUS_PUSH_BUSY_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__STATUS_PUSH_BUSY_Pos)) /* Assignment of value for PUSH_BUSY in the CAM_CryptoMaster_DMA_Registers__STATUS register */
#define CAM_CryptoMaster_DMA_Registers__STATUS_FETCH_NOT_EMPTY_Pos _UINT32_(4)                                          /* (CAM_CryptoMaster_DMA_Registers__STATUS)  Position */
#define CAM_CryptoMaster_DMA_Registers__STATUS_FETCH_NOT_EMPTY_Msk (_UINT32_(0x1) << CAM_CryptoMaster_DMA_Registers__STATUS_FETCH_NOT_EMPTY_Pos) /* (CAM_CryptoMaster_DMA_Registers__STATUS)  Mask */
#define CAM_CryptoMaster_DMA_Registers__STATUS_FETCH_NOT_EMPTY(value) (CAM_CryptoMaster_DMA_Registers__STATUS_FETCH_NOT_EMPTY_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__STATUS_FETCH_NOT_EMPTY_Pos)) /* Assignment of value for FETCH_NOT_EMPTY in the CAM_CryptoMaster_DMA_Registers__STATUS register */
#define CAM_CryptoMaster_DMA_Registers__STATUS_PUSH_WAITINGFIFO_Pos _UINT32_(5)                                          /* (CAM_CryptoMaster_DMA_Registers__STATUS)  Position */
#define CAM_CryptoMaster_DMA_Registers__STATUS_PUSH_WAITINGFIFO_Msk (_UINT32_(0x1) << CAM_CryptoMaster_DMA_Registers__STATUS_PUSH_WAITINGFIFO_Pos) /* (CAM_CryptoMaster_DMA_Registers__STATUS)  Mask */
#define CAM_CryptoMaster_DMA_Registers__STATUS_PUSH_WAITINGFIFO(value) (CAM_CryptoMaster_DMA_Registers__STATUS_PUSH_WAITINGFIFO_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__STATUS_PUSH_WAITINGFIFO_Pos)) /* Assignment of value for PUSH_WAITINGFIFO in the CAM_CryptoMaster_DMA_Registers__STATUS register */
#define CAM_CryptoMaster_DMA_Registers__STATUS_SOFT_RST_BUSY_Pos _UINT32_(6)                                          /* (CAM_CryptoMaster_DMA_Registers__STATUS)  Position */
#define CAM_CryptoMaster_DMA_Registers__STATUS_SOFT_RST_BUSY_Msk (_UINT32_(0x1) << CAM_CryptoMaster_DMA_Registers__STATUS_SOFT_RST_BUSY_Pos) /* (CAM_CryptoMaster_DMA_Registers__STATUS)  Mask */
#define CAM_CryptoMaster_DMA_Registers__STATUS_SOFT_RST_BUSY(value) (CAM_CryptoMaster_DMA_Registers__STATUS_SOFT_RST_BUSY_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__STATUS_SOFT_RST_BUSY_Pos)) /* Assignment of value for SOFT_RST_BUSY in the CAM_CryptoMaster_DMA_Registers__STATUS register */
#define CAM_CryptoMaster_DMA_Registers__STATUS_PUSH_NBDATA_Pos _UINT32_(16)                                         /* (CAM_CryptoMaster_DMA_Registers__STATUS)  Position */
#define CAM_CryptoMaster_DMA_Registers__STATUS_PUSH_NBDATA_Msk (_UINT32_(0xFFFF) << CAM_CryptoMaster_DMA_Registers__STATUS_PUSH_NBDATA_Pos) /* (CAM_CryptoMaster_DMA_Registers__STATUS)  Mask */
#define CAM_CryptoMaster_DMA_Registers__STATUS_PUSH_NBDATA(value) (CAM_CryptoMaster_DMA_Registers__STATUS_PUSH_NBDATA_Msk & (_UINT32_(value) << CAM_CryptoMaster_DMA_Registers__STATUS_PUSH_NBDATA_Pos)) /* Assignment of value for PUSH_NBDATA in the CAM_CryptoMaster_DMA_Registers__STATUS register */
#define CAM_CryptoMaster_DMA_Registers__STATUS_Msk _UINT32_(0xFFFF0073)                                 /* (CAM_CryptoMaster_DMA_Registers__STATUS) Register Mask  */


/* -------- CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG : (CAM Offset: 0x10400) ( R/ 32)  -------- */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_RESETVALUE _UINT32_(0x611)                                      /*  (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG)   Reset Value */

