Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/cam.h
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA411_AES_INCLUDED_Pos _UINT32_(0)                                          /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeAES value. BA411E-AES IP included if set Position */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA411_AES_INCLUDED_Msk (_UINT32_(0x1) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA411_AES_INCLUDED_Pos) /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeAES value. BA411E-AES IP included if set Mask */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA411_AES_INCLUDED(value) (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA411_AES_INCLUDED_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA411_AES_INCLUDED_Pos)) /* Assignment of value for BA411_AES_INCLUDED in the CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED_Pos _UINT32_(1)                                          /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeAESGCM value. BA415-HP-AES-GCM IP included if set Position */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED_Msk (_UINT32_(0x1) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED_Pos) /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeAESGCM value. BA415-HP-AES-GCM IP included if set Mask */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED(value) (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED_Pos)) /* Assignment of value for BA415_HP_AES_GCM_INCLUDED in the CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED_Pos _UINT32_(2)                                          /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeAESXTS value. BA416-HP-AES-XTS IP included if set Position */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED_Msk (_UINT32_(0x1) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED_Pos) /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeAESXTS value. BA416-HP-AES-XTS IP included if set Mask */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED(value) (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED_Pos)) /* Assignment of value for BA416_HP_AES_XTS_INCLUDED in the CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA412_DES_INCLUDED_Pos _UINT32_(3)                                          /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeDES value. BA412-3DES IP included if set Position */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA412_DES_INCLUDED_Msk (_UINT32_(0x1) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA412_DES_INCLUDED_Pos) /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeDES value. BA412-3DES IP included if set Mask */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA412_DES_INCLUDED(value) (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA412_DES_INCLUDED_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA412_DES_INCLUDED_Pos)) /* Assignment of value for BA412_DES_INCLUDED in the CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA413_HASH_INCLUDED_Pos _UINT32_(4)                                          /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeHASH value. BA413-HASH IP included if set Position */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA413_HASH_INCLUDED_Msk (_UINT32_(0x1) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA413_HASH_INCLUDED_Pos) /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeHASH value. BA413-HASH IP included if set Mask */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA413_HASH_INCLUDED(value) (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA413_HASH_INCLUDED_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA413_HASH_INCLUDED_Pos)) /* Assignment of value for BA413_HASH_INCLUDED in the CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED_Pos _UINT32_(5)                                          /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeChachaPoly value. BA417-ChaChaPoly IP included if set Position */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED_Msk (_UINT32_(0x1) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED_Pos) /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeChachaPoly value. BA417-ChaChaPoly IP included if set Mask */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED(value) (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED_Pos)) /* Assignment of value for BA417_CHACHAPOLY_INCLUDED in the CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED_Pos _UINT32_(6)                                          /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeSHA3  value. BA418-SHA3 IP included if set Position */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED_Msk (_UINT32_(0x1) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED_Pos) /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeSHA3  value. BA418-SHA3 IP included if set Mask */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED(value) (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED_Pos)) /* Assignment of value for BA418_SHA3_INCLUDED in the CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED_Pos _UINT32_(7)                                          /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeZUC  value. BA421-ZUC IP included if set Position */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED_Msk (_UINT32_(0x1) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED_Pos) /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeZUC  value. BA421-ZUC IP included if set Mask */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED(value) (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED_Pos)) /* Assignment of value for BA421_ZUC_INCLUDED in the CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA419_SM4_INCLUDED_Pos _UINT32_(8)                                          /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeSM4  value. BA419-SM4 IP included if set Position */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA419_SM4_INCLUDED_Msk (_UINT32_(0x1) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA419_SM4_INCLUDED_Pos) /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeSM4  value. BA419-SM4 IP included if set Mask */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA419_SM4_INCLUDED(value) (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA419_SM4_INCLUDED_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA419_SM4_INCLUDED_Pos)) /* Assignment of value for BA419_SM4_INCLUDED in the CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED_Pos _UINT32_(9)                                          /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludePKE  value. BA414EP-PKE IP included if set Position */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED_Msk (_UINT32_(0x1) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED_Pos) /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludePKE  value. BA414EP-PKE IP included if set Mask */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED(value) (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED_Pos)) /* Assignment of value for BA414EP_PKE_INCLUDED in the CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED_Pos _UINT32_(10)                                         /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeNDRNG  value. BA431-NDRNG IP included if set Position */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED_Msk (_UINT32_(0x1) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED_Pos) /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeNDRNG  value. BA431-NDRNG IP included if set Mask */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED(value) (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED_Pos)) /* Assignment of value for BA431_NDRNG_INCLUDED in the CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED_Pos _UINT32_(11)                                         /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeHPChachaPoly  value. BA420-HP-ChaChaPoly IP included if set Position */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED_Msk (_UINT32_(0x1) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED_Pos) /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeHPChachaPoly  value. BA420-HP-ChaChaPoly IP included if set Mask */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED(value) (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED_Pos)) /* Assignment of value for BA420_HP_CHACHAPOLY_INCLUDED in the CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED_Pos _UINT32_(12)                                         /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeSnow3G  value. BA423-Snow3G IP included if set Position */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED_Msk (_UINT32_(0x1) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED_Pos) /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeSnow3G  value. BA423-Snow3G IP included if set Mask */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED(value) (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED_Pos)) /* Assignment of value for BA423_SNOW3G_INCLUDED in the CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED_Pos _UINT32_(13)                                         /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeKasumi  value. BA422-Kasumi IP included if set Position */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED_Msk (_UINT32_(0x1) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED_Pos) /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Generic g_IncludeKasumi  value. BA422-Kasumi IP included if set Mask */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED(value) (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED_Pos)) /* Assignment of value for BA422_KASUMI_INCLUDED in the CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG register */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_Msk _UINT32_(0x00003FFF)                                 /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG) Register Mask  */


/* -------- CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1 : (CAM Offset: 0x10404) ( R/ 32)  -------- */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_RESETVALUE _UINT32_(0x1F0301FF)                                 /*  (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1)   Reset Value */

#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE_Pos _UINT32_(0)                                          /* (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_AesModesPoss value. BA411E-AES engine configuration. Position */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE_Msk (_UINT32_(0x1FF) << CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE_Pos) /* (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_AesModesPoss value. BA411E-AES engine configuration. Mask */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE(value) (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE_Pos)) /* Assignment of value for BA411E_AES_HW_CFG_MODE in the CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1 register */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS_Pos _UINT32_(16)                                         /* (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_CS value. BA411E-AES engine configuration. Position */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS_Msk (_UINT32_(0x1) << CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS_Pos) /* (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_CS value. BA411E-AES engine configuration. Mask */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS(value) (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS_Pos)) /* Assignment of value for BA411E_AES_HW_CFG_CS in the CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1 register */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING_Pos _UINT32_(17)                                         /* (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_UseMasking value. BA411E-AES engine configuration. Position */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING_Msk (_UINT32_(0x1) << CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING_Pos) /* (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_UseMasking value. BA411E-AES engine configuration. Mask */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING(value) (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING_Pos)) /* Assignment of value for BA411E_AES_HW_CFG_MASKING in the CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1 register */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE_Pos _UINT32_(24)                                         /* (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_Keysize value. BA411E-AES engine configuration. Position */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE_Msk (_UINT32_(0x7) << CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE_Pos) /* (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_Keysize value. BA411E-AES engine configuration. Mask */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE(value) (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE_Pos)) /* Assignment of value for BA411E_AES_HW_CFG_KEYSIZE in the CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1 register */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CXSWITCH_Pos _UINT32_(27)                                         /* (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_CxSwitch value. BA411E-AES engine configuration. Position */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CXSWITCH_Msk (_UINT32_(0x1) << CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CXSWITCH_Pos) /* (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_CxSwitch value. BA411E-AES engine configuration. Mask */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CXSWITCH(value) (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CXSWITCH_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CXSWITCH_Pos)) /* Assignment of value for BA411E_AES_HW_CFG_CXSWITCH in the CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1 register */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_GLITCHPROTECTION_Pos _UINT32_(28)                                         /* (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_GlitchProtection value. BA411E-AES engine configuration. Position */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_GLITCHPROTECTION_Msk (_UINT32_(0x1) << CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_GLITCHPROTECTION_Pos) /* (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Generic g_GlitchProtection value. BA411E-AES engine configuration. Mask */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_GLITCHPROTECTION(value) (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_GLITCHPROTECTION_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_GLITCHPROTECTION_Pos)) /* Assignment of value for BA411E_AES_HW_CFG_GLITCHPROTECTION in the CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1 register */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_Msk _UINT32_(0x1F0301FF)                                 /* (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1) Register Mask  */


