Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/cam.h
/* -------- CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2 : (CAM Offset: 0x10408) ( R/ 32) Generic g_CtrSize value. BA411E-AES engine configuration. -------- */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_RESETVALUE _UINT32_(0x200080)                                   /*  (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2) Generic g_CtrSize value. BA411E-AES engine configuration.  Reset Value */

#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_CTRSIZE_Pos _UINT32_(0)                                          /* (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2) Generic g_CtrSize value. BA411E-AES engine configuration. Position */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_CTRSIZE_Msk (_UINT32_(0xFFFF) << CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_CTRSIZE_Pos) /* (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2) Generic g_CtrSize value. BA411E-AES engine configuration. Mask */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_CTRSIZE(value) (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_CTRSIZE_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_CTRSIZE_Pos)) /* Assignment of value for BA411E_AES_HW_CFG_2_CTRSIZE in the CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2 register */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_EXTKEYS_Pos _UINT32_(20)                                         /* (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2) Generic g_Ext_nb_AES_keys value. BA411E-AES engine configuration. Position */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_EXTKEYS_Msk (_UINT32_(0xF) << CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_EXTKEYS_Pos) /* (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2) Generic g_Ext_nb_AES_keys value. BA411E-AES engine configuration. Mask */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_EXTKEYS(value) (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_EXTKEYS_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_EXTKEYS_Pos)) /* Assignment of value for BA411E_AES_HW_CFG_2_EXTKEYS in the CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2 register */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_IKGKEYS_Pos _UINT32_(24)                                         /* (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2) Generic  g_IKG_nb_AES_keys value. BA411E-AES engine configuration. Position */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_IKGKEYS_Msk (_UINT32_(0xF) << CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_IKGKEYS_Pos) /* (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2) Generic  g_IKG_nb_AES_keys value. BA411E-AES engine configuration. Mask */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_IKGKEYS(value) (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_IKGKEYS_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_BA411E_AES_HW_CFG_2_IKGKEYS_Pos)) /* Assignment of value for BA411E_AES_HW_CFG_2_IKGKEYS in the CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2 register */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_Msk _UINT32_(0x0FF0FFFF)                                 /* (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2) Register Mask  */


/* -------- CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG : (CAM Offset: 0x1040C) ( R/ 32)  -------- */
#define CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_RESETVALUE _UINT32_(0x13003E)                                   /*  (CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG)   Reset Value */

#define CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_MASK_Pos _UINT32_(0)                                          /* (CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG) Generic g_HashMaskFunc value. BA413-Hash engine configuration. Position */
#define CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_MASK_Msk (_UINT32_(0x7F) << CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_MASK_Pos) /* (CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG) Generic g_HashMaskFunc value. BA413-Hash engine configuration. Mask */
#define CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_MASK(value) (CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_MASK_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_MASK_Pos)) /* Assignment of value for BA413_HASH_HW_CFG_MASK in the CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG register */
#define CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_PADDING_Pos _UINT32_(16)                                         /* (CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG) Generic g_HashPadding value. BA413-Hash engine configuration. Position */
#define CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_PADDING_Msk (_UINT32_(0x1) << CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_PADDING_Pos) /* (CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG) Generic g_HashPadding value. BA413-Hash engine configuration. Mask */
#define CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_PADDING(value) (CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_PADDING_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_PADDING_Pos)) /* Assignment of value for BA413_HASH_HW_CFG_PADDING in the CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG register */
#define CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_HMAC_Pos _UINT32_(17)                                         /* (CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG) Generic g_HMAC_enabled value. BA413-Hash engine configuration. Position */
#define CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_HMAC_Msk (_UINT32_(0x1) << CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_HMAC_Pos) /* (CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG) Generic g_HMAC_enabled value. BA413-Hash engine configuration. Mask */
#define CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_HMAC(value) (CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_HMAC_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_HMAC_Pos)) /* Assignment of value for BA413_HASH_HW_CFG_HMAC in the CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG register */
#define CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_VERIFYDIGEST_Pos _UINT32_(18)                                         /* (CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG) Generic g_HashVerifyDigest value. BA413-Hash engine configuration. Position */
#define CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_VERIFYDIGEST_Msk (_UINT32_(0x1) << CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_VERIFYDIGEST_Pos) /* (CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG) Generic g_HashVerifyDigest value. BA413-Hash engine configuration. Mask */
#define CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_VERIFYDIGEST(value) (CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_VERIFYDIGEST_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_VERIFYDIGEST_Pos)) /* Assignment of value for BA413_HASH_HW_CFG_VERIFYDIGEST in the CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG register */
#define CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_EXTKEYS_Pos _UINT32_(20)                                         /* (CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG) Generic g_Ext_nb_Hash_keys value. BA413-Hash engine configuration. Position */
#define CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_EXTKEYS_Msk (_UINT32_(0xF) << CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_EXTKEYS_Pos) /* (CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG) Generic g_Ext_nb_Hash_keys value. BA413-Hash engine configuration. Mask */
#define CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_EXTKEYS(value) (CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_EXTKEYS_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_EXTKEYS_Pos)) /* Assignment of value for BA413_HASH_HW_CFG_EXTKEYS in the CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG register */
#define CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_IKGKEYS_Pos _UINT32_(24)                                         /* (CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG) Generic g_IKG_nb_Hash_keys value. BA413-Hash engine configuration. Position */
#define CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_IKGKEYS_Msk (_UINT32_(0xF) << CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_IKGKEYS_Pos) /* (CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG) Generic g_IKG_nb_Hash_keys value. BA413-Hash engine configuration. Mask */
#define CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_IKGKEYS(value) (CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_IKGKEYS_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_BA413_HASH_HW_CFG_IKGKEYS_Pos)) /* Assignment of value for BA413_HASH_HW_CFG_IKGKEYS in the CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG register */
#define CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_Msk _UINT32_(0x0FF7007F)                                 /* (CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG) Register Mask  */


/* -------- CAM_CryptoMaster_HWConf_Registers__BA418_SHA3_HW_CFG : (CAM Offset: 0x10410) ( R/ 32) Generic g_Sha3CtxtEn value. BA418-SHA3 configuration. -------- */
#define CAM_CryptoMaster_HWConf_Registers__BA418_SHA3_HW_CFG_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_CryptoMaster_HWConf_Registers__BA418_SHA3_HW_CFG) Generic g_Sha3CtxtEn value. BA418-SHA3 configuration.  Reset Value */

#define CAM_CryptoMaster_HWConf_Registers__BA418_SHA3_HW_CFG_BA418_SHA3_HW_CFG_Pos _UINT32_(0)                                          /* (CAM_CryptoMaster_HWConf_Registers__BA418_SHA3_HW_CFG) Generic g_Sha3CtxtEn value. BA418-SHA3 configuration. Position */
#define CAM_CryptoMaster_HWConf_Registers__BA418_SHA3_HW_CFG_BA418_SHA3_HW_CFG_Msk (_UINT32_(0x1) << CAM_CryptoMaster_HWConf_Registers__BA418_SHA3_HW_CFG_BA418_SHA3_HW_CFG_Pos) /* (CAM_CryptoMaster_HWConf_Registers__BA418_SHA3_HW_CFG) Generic g_Sha3CtxtEn value. BA418-SHA3 configuration. Mask */
#define CAM_CryptoMaster_HWConf_Registers__BA418_SHA3_HW_CFG_BA418_SHA3_HW_CFG(value) (CAM_CryptoMaster_HWConf_Registers__BA418_SHA3_HW_CFG_BA418_SHA3_HW_CFG_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__BA418_SHA3_HW_CFG_BA418_SHA3_HW_CFG_Pos)) /* Assignment of value for BA418_SHA3_HW_CFG in the CAM_CryptoMaster_HWConf_Registers__BA418_SHA3_HW_CFG register */
#define CAM_CryptoMaster_HWConf_Registers__BA418_SHA3_HW_CFG_Msk _UINT32_(0x00000001)                                 /* (CAM_CryptoMaster_HWConf_Registers__BA418_SHA3_HW_CFG) Register Mask  */


