Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/cam.h
/* -------- CAM_CryptoMaster_HWConf_Registers__BA419_SM4_HW_CFG : (CAM Offset: 0x10414) ( R/ 32) Generic g_SM4ModesPoss value. BA419-SM4 engine configuration. -------- */
#define CAM_CryptoMaster_HWConf_Registers__BA419_SM4_HW_CFG_RESETVALUE _UINT32_(0x1FF)                                      /*  (CAM_CryptoMaster_HWConf_Registers__BA419_SM4_HW_CFG) Generic g_SM4ModesPoss value. BA419-SM4 engine configuration.  Reset Value */

#define CAM_CryptoMaster_HWConf_Registers__BA419_SM4_HW_CFG_BA419_SM4_HW_CFG_Pos _UINT32_(0)                                          /* (CAM_CryptoMaster_HWConf_Registers__BA419_SM4_HW_CFG) Generic g_SM4ModesPoss value. BA419-SM4 engine configuration. Position */
#define CAM_CryptoMaster_HWConf_Registers__BA419_SM4_HW_CFG_BA419_SM4_HW_CFG_Msk (_UINT32_(0x1FF) << CAM_CryptoMaster_HWConf_Registers__BA419_SM4_HW_CFG_BA419_SM4_HW_CFG_Pos) /* (CAM_CryptoMaster_HWConf_Registers__BA419_SM4_HW_CFG) Generic g_SM4ModesPoss value. BA419-SM4 engine configuration. Mask */
#define CAM_CryptoMaster_HWConf_Registers__BA419_SM4_HW_CFG_BA419_SM4_HW_CFG(value) (CAM_CryptoMaster_HWConf_Registers__BA419_SM4_HW_CFG_BA419_SM4_HW_CFG_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__BA419_SM4_HW_CFG_BA419_SM4_HW_CFG_Pos)) /* Assignment of value for BA419_SM4_HW_CFG in the CAM_CryptoMaster_HWConf_Registers__BA419_SM4_HW_CFG register */
#define CAM_CryptoMaster_HWConf_Registers__BA419_SM4_HW_CFG_Msk _UINT32_(0x000001FF)                                 /* (CAM_CryptoMaster_HWConf_Registers__BA419_SM4_HW_CFG) Register Mask  */


/* -------- CAM_CryptoMaster_HWConf_Registers__BA424_ARIA_HW_CFG : (CAM Offset: 0x10418) ( R/ 32) Generic g_aria_modePoss value. BA424-Aria engine configuration. -------- */
#define CAM_CryptoMaster_HWConf_Registers__BA424_ARIA_HW_CFG_RESETVALUE _UINT32_(0x17F)                                      /*  (CAM_CryptoMaster_HWConf_Registers__BA424_ARIA_HW_CFG) Generic g_aria_modePoss value. BA424-Aria engine configuration.  Reset Value */

#define CAM_CryptoMaster_HWConf_Registers__BA424_ARIA_HW_CFG_BA424_ARIA_HW_CFG_Pos _UINT32_(0)                                          /* (CAM_CryptoMaster_HWConf_Registers__BA424_ARIA_HW_CFG) Generic g_aria_modePoss value. BA424-Aria engine configuration. Position */
#define CAM_CryptoMaster_HWConf_Registers__BA424_ARIA_HW_CFG_BA424_ARIA_HW_CFG_Msk (_UINT32_(0x1FF) << CAM_CryptoMaster_HWConf_Registers__BA424_ARIA_HW_CFG_BA424_ARIA_HW_CFG_Pos) /* (CAM_CryptoMaster_HWConf_Registers__BA424_ARIA_HW_CFG) Generic g_aria_modePoss value. BA424-Aria engine configuration. Mask */
#define CAM_CryptoMaster_HWConf_Registers__BA424_ARIA_HW_CFG_BA424_ARIA_HW_CFG(value) (CAM_CryptoMaster_HWConf_Registers__BA424_ARIA_HW_CFG_BA424_ARIA_HW_CFG_Msk & (_UINT32_(value) << CAM_CryptoMaster_HWConf_Registers__BA424_ARIA_HW_CFG_BA424_ARIA_HW_CFG_Pos)) /* Assignment of value for BA424_ARIA_HW_CFG in the CAM_CryptoMaster_HWConf_Registers__BA424_ARIA_HW_CFG register */
#define CAM_CryptoMaster_HWConf_Registers__BA424_ARIA_HW_CFG_Msk _UINT32_(0x000001FF)                                 /* (CAM_CryptoMaster_HWConf_Registers__BA424_ARIA_HW_CFG) Register Mask  */


/* -------- CAM_RNG_Control_Registers__Control : (CAM Offset: 0x11000) (R/W 32) Control register -------- */
#define CAM_RNG_Control_Registers__Control_RESETVALUE _UINT32_(0x40000)                                    /*  (CAM_RNG_Control_Registers__Control) Control register  Reset Value */

#define CAM_RNG_Control_Registers__Control_Enable_Pos _UINT32_(0)                                          /* (CAM_RNG_Control_Registers__Control) Enable the NDRNG. Position */
#define CAM_RNG_Control_Registers__Control_Enable_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Control_Enable_Pos) /* (CAM_RNG_Control_Registers__Control) Enable the NDRNG. Mask */
#define CAM_RNG_Control_Registers__Control_Enable(value) (CAM_RNG_Control_Registers__Control_Enable_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Control_Enable_Pos)) /* Assignment of value for Enable in the CAM_RNG_Control_Registers__Control register */
#define CAM_RNG_Control_Registers__Control_LFSREn_Pos _UINT32_(1)                                          /* (CAM_RNG_Control_Registers__Control) Select between the NDRNG with asynchronous free running oscillators (when '0') and the Pseudo-Random generator with synchronous oscillators for simulation purpose (when '1'). Position */
#define CAM_RNG_Control_Registers__Control_LFSREn_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Control_LFSREn_Pos) /* (CAM_RNG_Control_Registers__Control) Select between the NDRNG with asynchronous free running oscillators (when '0') and the Pseudo-Random generator with synchronous oscillators for simulation purpose (when '1'). Mask */
#define CAM_RNG_Control_Registers__Control_LFSREn(value) (CAM_RNG_Control_Registers__Control_LFSREn_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Control_LFSREn_Pos)) /* Assignment of value for LFSREn in the CAM_RNG_Control_Registers__Control register */
#define CAM_RNG_Control_Registers__Control_TestEn_Pos _UINT32_(2)                                          /* (CAM_RNG_Control_Registers__Control) Select input for conditioning function and continuous tests: 0: Noise source (normal mode), 1: Test data register (test mode). Position */
#define CAM_RNG_Control_Registers__Control_TestEn_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Control_TestEn_Pos) /* (CAM_RNG_Control_Registers__Control) Select input for conditioning function and continuous tests: 0: Noise source (normal mode), 1: Test data register (test mode). Mask */
#define CAM_RNG_Control_Registers__Control_TestEn(value) (CAM_RNG_Control_Registers__Control_TestEn_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Control_TestEn_Pos)) /* Assignment of value for TestEn in the CAM_RNG_Control_Registers__Control register */
#define CAM_RNG_Control_Registers__Control_CondBypass_Pos _UINT32_(3)                                          /* (CAM_RNG_Control_Registers__Control) 0: the conditioning function is used (normal mode), 1: the conditioning function is bypassed (to observe entropy source directly). Position */
#define CAM_RNG_Control_Registers__Control_CondBypass_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Control_CondBypass_Pos) /* (CAM_RNG_Control_Registers__Control) 0: the conditioning function is used (normal mode), 1: the conditioning function is bypassed (to observe entropy source directly). Mask */
#define CAM_RNG_Control_Registers__Control_CondBypass(value) (CAM_RNG_Control_Registers__Control_CondBypass_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Control_CondBypass_Pos)) /* Assignment of value for CondBypass in the CAM_RNG_Control_Registers__Control register */
#define CAM_RNG_Control_Registers__Control_IntEnRep_Pos _UINT32_(4)                                          /* (CAM_RNG_Control_Registers__Control) Interrupt enable for Repetition Count Test failure. Position */
#define CAM_RNG_Control_Registers__Control_IntEnRep_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Control_IntEnRep_Pos) /* (CAM_RNG_Control_Registers__Control) Interrupt enable for Repetition Count Test failure. Mask */
#define CAM_RNG_Control_Registers__Control_IntEnRep(value) (CAM_RNG_Control_Registers__Control_IntEnRep_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Control_IntEnRep_Pos)) /* Assignment of value for IntEnRep in the CAM_RNG_Control_Registers__Control register */
#define CAM_RNG_Control_Registers__Control_IntEnProp_Pos _UINT32_(5)                                          /* (CAM_RNG_Control_Registers__Control) Interrupt enable for Adaptive Proportion Test failure (1024-sample window). Position */
#define CAM_RNG_Control_Registers__Control_IntEnProp_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Control_IntEnProp_Pos) /* (CAM_RNG_Control_Registers__Control) Interrupt enable for Adaptive Proportion Test failure (1024-sample window). Mask */
#define CAM_RNG_Control_Registers__Control_IntEnProp(value) (CAM_RNG_Control_Registers__Control_IntEnProp_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Control_IntEnProp_Pos)) /* Assignment of value for IntEnProp in the CAM_RNG_Control_Registers__Control register */
#define CAM_RNG_Control_Registers__Control_IntEnFull_Pos _UINT32_(7)                                          /* (CAM_RNG_Control_Registers__Control) Interrupt enable for FIFO full. Position */
#define CAM_RNG_Control_Registers__Control_IntEnFull_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Control_IntEnFull_Pos) /* (CAM_RNG_Control_Registers__Control) Interrupt enable for FIFO full. Mask */
#define CAM_RNG_Control_Registers__Control_IntEnFull(value) (CAM_RNG_Control_Registers__Control_IntEnFull_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Control_IntEnFull_Pos)) /* Assignment of value for IntEnFull in the CAM_RNG_Control_Registers__Control register */
#define CAM_RNG_Control_Registers__Control_SoftRst_Pos _UINT32_(8)                                          /* (CAM_RNG_Control_Registers__Control) Software reset: 0: Normal mode, 1: The continuous test, the conditioning function and the FIFO are reset. This bit is not cleared automatically. Position */
#define CAM_RNG_Control_Registers__Control_SoftRst_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Control_SoftRst_Pos) /* (CAM_RNG_Control_Registers__Control) Software reset: 0: Normal mode, 1: The continuous test, the conditioning function and the FIFO are reset. This bit is not cleared automatically. Mask */
#define CAM_RNG_Control_Registers__Control_SoftRst(value) (CAM_RNG_Control_Registers__Control_SoftRst_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Control_SoftRst_Pos)) /* Assignment of value for SoftRst in the CAM_RNG_Control_Registers__Control register */
#define CAM_RNG_Control_Registers__Control_IntEnPre_Pos _UINT32_(9)                                          /* (CAM_RNG_Control_Registers__Control) Interrupt enable for AIS31 preliminary noise alarm. Position */
#define CAM_RNG_Control_Registers__Control_IntEnPre_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Control_IntEnPre_Pos) /* (CAM_RNG_Control_Registers__Control) Interrupt enable for AIS31 preliminary noise alarm. Mask */
#define CAM_RNG_Control_Registers__Control_IntEnPre(value) (CAM_RNG_Control_Registers__Control_IntEnPre_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Control_IntEnPre_Pos)) /* Assignment of value for IntEnPre in the CAM_RNG_Control_Registers__Control register */
#define CAM_RNG_Control_Registers__Control_IntEnAlm_Pos _UINT32_(10)                                         /* (CAM_RNG_Control_Registers__Control) Interrupt enable for AIS31 noise alarm. Position */
#define CAM_RNG_Control_Registers__Control_IntEnAlm_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Control_IntEnAlm_Pos) /* (CAM_RNG_Control_Registers__Control) Interrupt enable for AIS31 noise alarm. Mask */
#define CAM_RNG_Control_Registers__Control_IntEnAlm(value) (CAM_RNG_Control_Registers__Control_IntEnAlm_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Control_IntEnAlm_Pos)) /* Assignment of value for IntEnAlm in the CAM_RNG_Control_Registers__Control register */
#define CAM_RNG_Control_Registers__Control_ForceActiveROs_Pos _UINT32_(11)                                         /* (CAM_RNG_Control_Registers__Control) Force oscillators to run when FIFO is full. Position */
#define CAM_RNG_Control_Registers__Control_ForceActiveROs_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Control_ForceActiveROs_Pos) /* (CAM_RNG_Control_Registers__Control) Force oscillators to run when FIFO is full. Mask */
#define CAM_RNG_Control_Registers__Control_ForceActiveROs(value) (CAM_RNG_Control_Registers__Control_ForceActiveROs_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Control_ForceActiveROs_Pos)) /* Assignment of value for ForceActiveROs in the CAM_RNG_Control_Registers__Control register */
#define CAM_RNG_Control_Registers__Control_HealthTestBypass_Pos _UINT32_(12)                                         /* (CAM_RNG_Control_Registers__Control) Bypass NIST tests such that the results of the start-up and online test do not affect the FSM state. Position */
#define CAM_RNG_Control_Registers__Control_HealthTestBypass_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Control_HealthTestBypass_Pos) /* (CAM_RNG_Control_Registers__Control) Bypass NIST tests such that the results of the start-up and online test do not affect the FSM state. Mask */
#define CAM_RNG_Control_Registers__Control_HealthTestBypass(value) (CAM_RNG_Control_Registers__Control_HealthTestBypass_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Control_HealthTestBypass_Pos)) /* Assignment of value for HealthTestBypass in the CAM_RNG_Control_Registers__Control register */
#define CAM_RNG_Control_Registers__Control_AIS31Bypass_Pos _UINT32_(13)                                         /* (CAM_RNG_Control_Registers__Control) Bypass AIS31 tests such that the results of the start-up and online tests do not affect the FSM state. Position */
#define CAM_RNG_Control_Registers__Control_AIS31Bypass_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Control_AIS31Bypass_Pos) /* (CAM_RNG_Control_Registers__Control) Bypass AIS31 tests such that the results of the start-up and online tests do not affect the FSM state. Mask */
#define CAM_RNG_Control_Registers__Control_AIS31Bypass(value) (CAM_RNG_Control_Registers__Control_AIS31Bypass_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Control_AIS31Bypass_Pos)) /* Assignment of value for AIS31Bypass in the CAM_RNG_Control_Registers__Control register */
#define CAM_RNG_Control_Registers__Control_HealthTestSel_Pos _UINT32_(14)                                         /* (CAM_RNG_Control_Registers__Control) Select input to health test module: 0: Before conditioning, 1: After conditioning. Position */
#define CAM_RNG_Control_Registers__Control_HealthTestSel_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Control_HealthTestSel_Pos) /* (CAM_RNG_Control_Registers__Control) Select input to health test module: 0: Before conditioning, 1: After conditioning. Mask */
#define CAM_RNG_Control_Registers__Control_HealthTestSel(value) (CAM_RNG_Control_Registers__Control_HealthTestSel_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Control_HealthTestSel_Pos)) /* Assignment of value for HealthTestSel in the CAM_RNG_Control_Registers__Control register */
#define CAM_RNG_Control_Registers__Control_AIS31TestSel_Pos _UINT32_(15)                                         /* (CAM_RNG_Control_Registers__Control) Select input to the AIS31 test module: 0: Before conditioning, 1: After conditioning. Position */
#define CAM_RNG_Control_Registers__Control_AIS31TestSel_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Control_AIS31TestSel_Pos) /* (CAM_RNG_Control_Registers__Control) Select input to the AIS31 test module: 0: Before conditioning, 1: After conditioning. Mask */
#define CAM_RNG_Control_Registers__Control_AIS31TestSel(value) (CAM_RNG_Control_Registers__Control_AIS31TestSel_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Control_AIS31TestSel_Pos)) /* Assignment of value for AIS31TestSel in the CAM_RNG_Control_Registers__Control register */
#define CAM_RNG_Control_Registers__Control_Nb128BitBlocks_Pos _UINT32_(16)                                         /* (CAM_RNG_Control_Registers__Control) Number of 128 bit blocks used in AES-CBCMAC post-processing. This value cannot be zero. Position */
#define CAM_RNG_Control_Registers__Control_Nb128BitBlocks_Msk (_UINT32_(0xF) << CAM_RNG_Control_Registers__Control_Nb128BitBlocks_Pos) /* (CAM_RNG_Control_Registers__Control) Number of 128 bit blocks used in AES-CBCMAC post-processing. This value cannot be zero. Mask */
#define CAM_RNG_Control_Registers__Control_Nb128BitBlocks(value) (CAM_RNG_Control_Registers__Control_Nb128BitBlocks_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Control_Nb128BitBlocks_Pos)) /* Assignment of value for Nb128BitBlocks in the CAM_RNG_Control_Registers__Control register */
#define CAM_RNG_Control_Registers__Control_FifoWriteStartUp_Pos _UINT32_(20)                                         /* (CAM_RNG_Control_Registers__Control) Enable write of the samples in the FIFO during start-up. Position */
#define CAM_RNG_Control_Registers__Control_FifoWriteStartUp_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Control_FifoWriteStartUp_Pos) /* (CAM_RNG_Control_Registers__Control) Enable write of the samples in the FIFO during start-up. Mask */
#define CAM_RNG_Control_Registers__Control_FifoWriteStartUp(value) (CAM_RNG_Control_Registers__Control_FifoWriteStartUp_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Control_FifoWriteStartUp_Pos)) /* Assignment of value for FifoWriteStartUp in the CAM_RNG_Control_Registers__Control register */
#define CAM_RNG_Control_Registers__Control_Msk _UINT32_(0x001FFFBF)                                 /* (CAM_RNG_Control_Registers__Control) Register Mask  */


/* -------- CAM_RNG_Control_Registers__FIFOLevel : (CAM Offset: 0x11004) (R/W 32) FIFO level register. -------- */
#define CAM_RNG_Control_Registers__FIFOLevel_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_RNG_Control_Registers__FIFOLevel) FIFO level register.  Reset Value */

#define CAM_RNG_Control_Registers__FIFOLevel_FIFOLevel_Pos _UINT32_(0)                                          /* (CAM_RNG_Control_Registers__FIFOLevel) Number of 32 bits words of random available in the FIFO. Any write to this register clears the FullInt flag in the Status register. Position */
#define CAM_RNG_Control_Registers__FIFOLevel_FIFOLevel_Msk (_UINT32_(0xFFFFFFFF) << CAM_RNG_Control_Registers__FIFOLevel_FIFOLevel_Pos) /* (CAM_RNG_Control_Registers__FIFOLevel) Number of 32 bits words of random available in the FIFO. Any write to this register clears the FullInt flag in the Status register. Mask */
#define CAM_RNG_Control_Registers__FIFOLevel_FIFOLevel(value) (CAM_RNG_Control_Registers__FIFOLevel_FIFOLevel_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__FIFOLevel_FIFOLevel_Pos)) /* Assignment of value for FIFOLevel in the CAM_RNG_Control_Registers__FIFOLevel register */
#define CAM_RNG_Control_Registers__FIFOLevel_Msk _UINT32_(0xFFFFFFFF)                                 /* (CAM_RNG_Control_Registers__FIFOLevel) Register Mask  */


/* -------- CAM_RNG_Control_Registers__FIFOThreshold : (CAM Offset: 0x11008) (R/W 32) FIFO threshold register. -------- */
#define CAM_RNG_Control_Registers__FIFOThreshold_RESETVALUE _UINT32_(0x01)                                       /*  (CAM_RNG_Control_Registers__FIFOThreshold) FIFO threshold register.  Reset Value */

#define CAM_RNG_Control_Registers__FIFOThreshold_FIFOThreshold_Pos _UINT32_(0)                                          /* (CAM_RNG_Control_Registers__FIFOThreshold) FIFO level below which the module leaves the idle state to refill the FIFO, expressed in number of 128bit blocks. Position */
#define CAM_RNG_Control_Registers__FIFOThreshold_FIFOThreshold_Msk (_UINT32_(0x3) << CAM_RNG_Control_Registers__FIFOThreshold_FIFOThreshold_Pos) /* (CAM_RNG_Control_Registers__FIFOThreshold) FIFO level below which the module leaves the idle state to refill the FIFO, expressed in number of 128bit blocks. Mask */
#define CAM_RNG_Control_Registers__FIFOThreshold_FIFOThreshold(value) (CAM_RNG_Control_Registers__FIFOThreshold_FIFOThreshold_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__FIFOThreshold_FIFOThreshold_Pos)) /* Assignment of value for FIFOThreshold in the CAM_RNG_Control_Registers__FIFOThreshold register */
#define CAM_RNG_Control_Registers__FIFOThreshold_Msk _UINT32_(0x00000003)                                 /* (CAM_RNG_Control_Registers__FIFOThreshold) Register Mask  */


/* -------- CAM_RNG_Control_Registers__FIFODepth : (CAM Offset: 0x1100C) ( R/ 32) FIFO depth register. -------- */
#define CAM_RNG_Control_Registers__FIFODepth_RESETVALUE _UINT32_(0x08)                                       /*  (CAM_RNG_Control_Registers__FIFODepth) FIFO depth register.  Reset Value */

#define CAM_RNG_Control_Registers__FIFODepth_FIFODepth_Pos _UINT32_(0)                                          /* (CAM_RNG_Control_Registers__FIFODepth) Maximum number of 32 bits words that can be stored in the FIFO: 2**g_fifodepth. Position */
#define CAM_RNG_Control_Registers__FIFODepth_FIFODepth_Msk (_UINT32_(0xFFFFFFFF) << CAM_RNG_Control_Registers__FIFODepth_FIFODepth_Pos) /* (CAM_RNG_Control_Registers__FIFODepth) Maximum number of 32 bits words that can be stored in the FIFO: 2**g_fifodepth. Mask */
#define CAM_RNG_Control_Registers__FIFODepth_FIFODepth(value) (CAM_RNG_Control_Registers__FIFODepth_FIFODepth_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__FIFODepth_FIFODepth_Pos)) /* Assignment of value for FIFODepth in the CAM_RNG_Control_Registers__FIFODepth register */
#define CAM_RNG_Control_Registers__FIFODepth_Msk _UINT32_(0xFFFFFFFF)                                 /* (CAM_RNG_Control_Registers__FIFODepth) Register Mask  */


/* -------- CAM_RNG_Control_Registers__Key0 : (CAM Offset: 0x11010) (R/W 32) Key register (MSB). -------- */
#define CAM_RNG_Control_Registers__Key0_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_RNG_Control_Registers__Key0) Key register (MSB).  Reset Value */

#define CAM_RNG_Control_Registers__Key0_Key0_Pos _UINT32_(0)                                          /* (CAM_RNG_Control_Registers__Key0) Key register (MSB). Position */
#define CAM_RNG_Control_Registers__Key0_Key0_Msk (_UINT32_(0xFFFFFFFF) << CAM_RNG_Control_Registers__Key0_Key0_Pos) /* (CAM_RNG_Control_Registers__Key0) Key register (MSB). Mask */
#define CAM_RNG_Control_Registers__Key0_Key0(value) (CAM_RNG_Control_Registers__Key0_Key0_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Key0_Key0_Pos)) /* Assignment of value for Key0 in the CAM_RNG_Control_Registers__Key0 register */
#define CAM_RNG_Control_Registers__Key0_Msk   _UINT32_(0xFFFFFFFF)                                 /* (CAM_RNG_Control_Registers__Key0) Register Mask  */


/* -------- CAM_RNG_Control_Registers__Key1 : (CAM Offset: 0x11014) (R/W 32) Key register. -------- */
#define CAM_RNG_Control_Registers__Key1_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_RNG_Control_Registers__Key1) Key register.  Reset Value */

#define CAM_RNG_Control_Registers__Key1_Key1_Pos _UINT32_(0)                                          /* (CAM_RNG_Control_Registers__Key1) Key register. Position */
#define CAM_RNG_Control_Registers__Key1_Key1_Msk (_UINT32_(0xFFFFFFFF) << CAM_RNG_Control_Registers__Key1_Key1_Pos) /* (CAM_RNG_Control_Registers__Key1) Key register. Mask */
#define CAM_RNG_Control_Registers__Key1_Key1(value) (CAM_RNG_Control_Registers__Key1_Key1_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Key1_Key1_Pos)) /* Assignment of value for Key1 in the CAM_RNG_Control_Registers__Key1 register */
#define CAM_RNG_Control_Registers__Key1_Msk   _UINT32_(0xFFFFFFFF)                                 /* (CAM_RNG_Control_Registers__Key1) Register Mask  */


/* -------- CAM_RNG_Control_Registers__Key2 : (CAM Offset: 0x11018) (R/W 32) Key register. -------- */
#define CAM_RNG_Control_Registers__Key2_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_RNG_Control_Registers__Key2) Key register.  Reset Value */

