Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/cam.h
#define CAM_RNG_Control_Registers__Key2_Key2_Pos _UINT32_(0)                                          /* (CAM_RNG_Control_Registers__Key2) Key register. Position */
#define CAM_RNG_Control_Registers__Key2_Key2_Msk (_UINT32_(0xFFFFFFFF) << CAM_RNG_Control_Registers__Key2_Key2_Pos) /* (CAM_RNG_Control_Registers__Key2) Key register. Mask */
#define CAM_RNG_Control_Registers__Key2_Key2(value) (CAM_RNG_Control_Registers__Key2_Key2_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Key2_Key2_Pos)) /* Assignment of value for Key2 in the CAM_RNG_Control_Registers__Key2 register */
#define CAM_RNG_Control_Registers__Key2_Msk   _UINT32_(0xFFFFFFFF)                                 /* (CAM_RNG_Control_Registers__Key2) Register Mask  */


/* -------- CAM_RNG_Control_Registers__Key3 : (CAM Offset: 0x1101C) (R/W 32) Key register (LSB). -------- */
#define CAM_RNG_Control_Registers__Key3_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_RNG_Control_Registers__Key3) Key register (LSB).  Reset Value */

#define CAM_RNG_Control_Registers__Key3_Key3_Pos _UINT32_(0)                                          /* (CAM_RNG_Control_Registers__Key3) Key register (LSB). Position */
#define CAM_RNG_Control_Registers__Key3_Key3_Msk (_UINT32_(0xFFFFFFFF) << CAM_RNG_Control_Registers__Key3_Key3_Pos) /* (CAM_RNG_Control_Registers__Key3) Key register (LSB). Mask */
#define CAM_RNG_Control_Registers__Key3_Key3(value) (CAM_RNG_Control_Registers__Key3_Key3_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Key3_Key3_Pos)) /* Assignment of value for Key3 in the CAM_RNG_Control_Registers__Key3 register */
#define CAM_RNG_Control_Registers__Key3_Msk   _UINT32_(0xFFFFFFFF)                                 /* (CAM_RNG_Control_Registers__Key3) Register Mask  */


/* -------- CAM_RNG_Control_Registers__TestData : (CAM Offset: 0x11020) ( /W 32) Test data register. -------- */
#define CAM_RNG_Control_Registers__TestData_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_RNG_Control_Registers__TestData) Test data register.  Reset Value */

#define CAM_RNG_Control_Registers__TestData_TestData_Pos _UINT32_(0)                                          /* (CAM_RNG_Control_Registers__TestData) Test data register. Position */
#define CAM_RNG_Control_Registers__TestData_TestData_Msk (_UINT32_(0xFFFFFFFF) << CAM_RNG_Control_Registers__TestData_TestData_Pos) /* (CAM_RNG_Control_Registers__TestData) Test data register. Mask */
#define CAM_RNG_Control_Registers__TestData_TestData(value) (CAM_RNG_Control_Registers__TestData_TestData_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__TestData_TestData_Pos)) /* Assignment of value for TestData in the CAM_RNG_Control_Registers__TestData register */
#define CAM_RNG_Control_Registers__TestData_Msk _UINT32_(0xFFFFFFFF)                                 /* (CAM_RNG_Control_Registers__TestData) Register Mask  */


/* -------- CAM_RNG_Control_Registers__RepeatThreshold : (CAM Offset: 0x11024) (R/W 32) Repetition Test Count Cut-Off value. -------- */
#define CAM_RNG_Control_Registers__RepeatThreshold_RESETVALUE _UINT32_(0x29)                                       /*  (CAM_RNG_Control_Registers__RepeatThreshold) Repetition Test Count Cut-Off value.  Reset Value */

#define CAM_RNG_Control_Registers__RepeatThreshold_RepeatThreshold_Pos _UINT32_(0)                                          /* (CAM_RNG_Control_Registers__RepeatThreshold) Repetition Test Count Cut-Off value. Position */
#define CAM_RNG_Control_Registers__RepeatThreshold_RepeatThreshold_Msk (_UINT32_(0x3F) << CAM_RNG_Control_Registers__RepeatThreshold_RepeatThreshold_Pos) /* (CAM_RNG_Control_Registers__RepeatThreshold) Repetition Test Count Cut-Off value. Mask */
#define CAM_RNG_Control_Registers__RepeatThreshold_RepeatThreshold(value) (CAM_RNG_Control_Registers__RepeatThreshold_RepeatThreshold_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__RepeatThreshold_RepeatThreshold_Pos)) /* Assignment of value for RepeatThreshold in the CAM_RNG_Control_Registers__RepeatThreshold register */
#define CAM_RNG_Control_Registers__RepeatThreshold_Msk _UINT32_(0x0000003F)                                 /* (CAM_RNG_Control_Registers__RepeatThreshold) Register Mask  */


/* -------- CAM_RNG_Control_Registers__PropThreshold : (CAM Offset: 0x11028) (R/W 32) Adaptive Proportion Test (1024-sample window) Cut-Off value. -------- */
#define CAM_RNG_Control_Registers__PropThreshold_RESETVALUE _UINT32_(0x319)                                      /*  (CAM_RNG_Control_Registers__PropThreshold) Adaptive Proportion Test (1024-sample window) Cut-Off value.  Reset Value */

#define CAM_RNG_Control_Registers__PropThreshold_PropThreshold_Pos _UINT32_(0)                                          /* (CAM_RNG_Control_Registers__PropThreshold) Adaptive Proportion Test (1024-sample window) Cut-Off value. Position */
#define CAM_RNG_Control_Registers__PropThreshold_PropThreshold_Msk (_UINT32_(0x3FF) << CAM_RNG_Control_Registers__PropThreshold_PropThreshold_Pos) /* (CAM_RNG_Control_Registers__PropThreshold) Adaptive Proportion Test (1024-sample window) Cut-Off value. Mask */
#define CAM_RNG_Control_Registers__PropThreshold_PropThreshold(value) (CAM_RNG_Control_Registers__PropThreshold_PropThreshold_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__PropThreshold_PropThreshold_Pos)) /* Assignment of value for PropThreshold in the CAM_RNG_Control_Registers__PropThreshold register */
#define CAM_RNG_Control_Registers__PropThreshold_Msk _UINT32_(0x000003FF)                                 /* (CAM_RNG_Control_Registers__PropThreshold) Register Mask  */


/* -------- CAM_RNG_Control_Registers__Status : (CAM Offset: 0x11030) (R/W 32) Status register. -------- */
#define CAM_RNG_Control_Registers__Status_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_RNG_Control_Registers__Status) Status register.  Reset Value */

#define CAM_RNG_Control_Registers__Status_TestDataBusy_Pos _UINT32_(0)                                          /* (CAM_RNG_Control_Registers__Status) High when data written to TestData register is being processed. (see section 4.7) Position */
#define CAM_RNG_Control_Registers__Status_TestDataBusy_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Status_TestDataBusy_Pos) /* (CAM_RNG_Control_Registers__Status) High when data written to TestData register is being processed. (see section 4.7) Mask */
#define CAM_RNG_Control_Registers__Status_TestDataBusy(value) (CAM_RNG_Control_Registers__Status_TestDataBusy_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Status_TestDataBusy_Pos)) /* Assignment of value for TestDataBusy in the CAM_RNG_Control_Registers__Status register */
#define CAM_RNG_Control_Registers__Status_State_Pos _UINT32_(1)                                          /* (CAM_RNG_Control_Registers__Status) State of the control FSM: 000: Reset, 001: Startup, 010: Idle (Rings On), 011: Idle (Rings Off), 100: Fill FIFO, 101: Error, 110: Unused, 111: Unused. Position */
#define CAM_RNG_Control_Registers__Status_State_Msk (_UINT32_(0x7) << CAM_RNG_Control_Registers__Status_State_Pos) /* (CAM_RNG_Control_Registers__Status) State of the control FSM: 000: Reset, 001: Startup, 010: Idle (Rings On), 011: Idle (Rings Off), 100: Fill FIFO, 101: Error, 110: Unused, 111: Unused. Mask */
#define CAM_RNG_Control_Registers__Status_State(value) (CAM_RNG_Control_Registers__Status_State_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Status_State_Pos)) /* Assignment of value for State in the CAM_RNG_Control_Registers__Status register */
#define CAM_RNG_Control_Registers__Status_RepFail_Pos _UINT32_(4)                                          /* (CAM_RNG_Control_Registers__Status) NIST-800-90B repetition Count Test interrupt status. Position */
#define CAM_RNG_Control_Registers__Status_RepFail_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Status_RepFail_Pos) /* (CAM_RNG_Control_Registers__Status) NIST-800-90B repetition Count Test interrupt status. Mask */
#define CAM_RNG_Control_Registers__Status_RepFail(value) (CAM_RNG_Control_Registers__Status_RepFail_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Status_RepFail_Pos)) /* Assignment of value for RepFail in the CAM_RNG_Control_Registers__Status register */
#define CAM_RNG_Control_Registers__Status_PropFail_Pos _UINT32_(5)                                          /* (CAM_RNG_Control_Registers__Status) NIST-800-90B adaptive Proportion Test (1024-sample window) interrupt status. Position */
#define CAM_RNG_Control_Registers__Status_PropFail_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Status_PropFail_Pos) /* (CAM_RNG_Control_Registers__Status) NIST-800-90B adaptive Proportion Test (1024-sample window) interrupt status. Mask */
#define CAM_RNG_Control_Registers__Status_PropFail(value) (CAM_RNG_Control_Registers__Status_PropFail_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Status_PropFail_Pos)) /* Assignment of value for PropFail in the CAM_RNG_Control_Registers__Status register */
#define CAM_RNG_Control_Registers__Status_FullInt_Pos _UINT32_(7)                                          /* (CAM_RNG_Control_Registers__Status) FIFO full status. Position */
#define CAM_RNG_Control_Registers__Status_FullInt_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Status_FullInt_Pos) /* (CAM_RNG_Control_Registers__Status) FIFO full status. Mask */
#define CAM_RNG_Control_Registers__Status_FullInt(value) (CAM_RNG_Control_Registers__Status_FullInt_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Status_FullInt_Pos)) /* Assignment of value for FullInt in the CAM_RNG_Control_Registers__Status register */
#define CAM_RNG_Control_Registers__Status_PreInt_Pos _UINT32_(8)                                          /* (CAM_RNG_Control_Registers__Status) AIS31 preliminary noise alarm interrupt status. Position */
#define CAM_RNG_Control_Registers__Status_PreInt_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Status_PreInt_Pos) /* (CAM_RNG_Control_Registers__Status) AIS31 preliminary noise alarm interrupt status. Mask */
#define CAM_RNG_Control_Registers__Status_PreInt(value) (CAM_RNG_Control_Registers__Status_PreInt_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Status_PreInt_Pos)) /* Assignment of value for PreInt in the CAM_RNG_Control_Registers__Status register */
#define CAM_RNG_Control_Registers__Status_AlmInt_Pos _UINT32_(9)                                          /* (CAM_RNG_Control_Registers__Status) AIS31 noise alarm interrupt status. Position */
#define CAM_RNG_Control_Registers__Status_AlmInt_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Status_AlmInt_Pos) /* (CAM_RNG_Control_Registers__Status) AIS31 noise alarm interrupt status. Mask */
#define CAM_RNG_Control_Registers__Status_AlmInt(value) (CAM_RNG_Control_Registers__Status_AlmInt_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Status_AlmInt_Pos)) /* Assignment of value for AlmInt in the CAM_RNG_Control_Registers__Status register */
#define CAM_RNG_Control_Registers__Status_StartUpFail_Pos _UINT32_(10)                                         /* (CAM_RNG_Control_Registers__Status) Start-up test failure. Position */
#define CAM_RNG_Control_Registers__Status_StartUpFail_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Status_StartUpFail_Pos) /* (CAM_RNG_Control_Registers__Status) Start-up test failure. Mask */
#define CAM_RNG_Control_Registers__Status_StartUpFail(value) (CAM_RNG_Control_Registers__Status_StartUpFail_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Status_StartUpFail_Pos)) /* Assignment of value for StartUpFail in the CAM_RNG_Control_Registers__Status register */
#define CAM_RNG_Control_Registers__Status_FifoAccFail_Pos _UINT32_(11)                                         /* (CAM_RNG_Control_Registers__Status) Set when a FIFO data read is performed while the NDRNG is disabled AND has its FIFO empty (FIFOLevel = 0). Position */
#define CAM_RNG_Control_Registers__Status_FifoAccFail_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__Status_FifoAccFail_Pos) /* (CAM_RNG_Control_Registers__Status) Set when a FIFO data read is performed while the NDRNG is disabled AND has its FIFO empty (FIFOLevel = 0). Mask */
#define CAM_RNG_Control_Registers__Status_FifoAccFail(value) (CAM_RNG_Control_Registers__Status_FifoAccFail_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__Status_FifoAccFail_Pos)) /* Assignment of value for FifoAccFail in the CAM_RNG_Control_Registers__Status register */
#define CAM_RNG_Control_Registers__Status_Msk _UINT32_(0x00000FBF)                                 /* (CAM_RNG_Control_Registers__Status) Register Mask  */


