Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/cam.h
/* -------- CAM_RNG_Control_Registers__InitWaitVal : (CAM Offset: 0x11034) (R/W 32) Initial wait counter value. -------- */
#define CAM_RNG_Control_Registers__InitWaitVal_RESETVALUE _UINT32_(0xFFFF)                                     /*  (CAM_RNG_Control_Registers__InitWaitVal) Initial wait counter value.  Reset Value */

#define CAM_RNG_Control_Registers__InitWaitVal_InitWaitVal_Pos _UINT32_(0)                                          /* (CAM_RNG_Control_Registers__InitWaitVal) Number of clock cycles to wait before sampling data from the noise source. Position */
#define CAM_RNG_Control_Registers__InitWaitVal_InitWaitVal_Msk (_UINT32_(0xFFFF) << CAM_RNG_Control_Registers__InitWaitVal_InitWaitVal_Pos) /* (CAM_RNG_Control_Registers__InitWaitVal) Number of clock cycles to wait before sampling data from the noise source. Mask */
#define CAM_RNG_Control_Registers__InitWaitVal_InitWaitVal(value) (CAM_RNG_Control_Registers__InitWaitVal_InitWaitVal_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__InitWaitVal_InitWaitVal_Pos)) /* Assignment of value for InitWaitVal in the CAM_RNG_Control_Registers__InitWaitVal register */
#define CAM_RNG_Control_Registers__InitWaitVal_Msk _UINT32_(0x0000FFFF)                                 /* (CAM_RNG_Control_Registers__InitWaitVal) Register Mask  */


/* -------- CAM_RNG_Control_Registers__DisableOsc0 : (CAM Offset: 0x11038) (R/W 32) Disable oscillator rings #0 to #31. -------- */
#define CAM_RNG_Control_Registers__DisableOsc0_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_RNG_Control_Registers__DisableOsc0) Disable oscillator rings #0 to #31.  Reset Value */

#define CAM_RNG_Control_Registers__DisableOsc0_DisableOsc0_Pos _UINT32_(0)                                          /* (CAM_RNG_Control_Registers__DisableOsc0) Disable oscillator rings #0 to #31. Position */
#define CAM_RNG_Control_Registers__DisableOsc0_DisableOsc0_Msk (_UINT32_(0xFFFFFFFF) << CAM_RNG_Control_Registers__DisableOsc0_DisableOsc0_Pos) /* (CAM_RNG_Control_Registers__DisableOsc0) Disable oscillator rings #0 to #31. Mask */
#define CAM_RNG_Control_Registers__DisableOsc0_DisableOsc0(value) (CAM_RNG_Control_Registers__DisableOsc0_DisableOsc0_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__DisableOsc0_DisableOsc0_Pos)) /* Assignment of value for DisableOsc0 in the CAM_RNG_Control_Registers__DisableOsc0 register */
#define CAM_RNG_Control_Registers__DisableOsc0_Msk _UINT32_(0xFFFFFFFF)                                 /* (CAM_RNG_Control_Registers__DisableOsc0) Register Mask  */


/* -------- CAM_RNG_Control_Registers__DisableOsc1 : (CAM Offset: 0x1103C) (R/W 32) Disable oscillator rings #32 to #63. -------- */
#define CAM_RNG_Control_Registers__DisableOsc1_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_RNG_Control_Registers__DisableOsc1) Disable oscillator rings #32 to #63.  Reset Value */

#define CAM_RNG_Control_Registers__DisableOsc1_DisableOsc1_Pos _UINT32_(0)                                          /* (CAM_RNG_Control_Registers__DisableOsc1) Disable oscillator rings #32 to #63. Position */
#define CAM_RNG_Control_Registers__DisableOsc1_DisableOsc1_Msk (_UINT32_(0xFFFFFFFF) << CAM_RNG_Control_Registers__DisableOsc1_DisableOsc1_Pos) /* (CAM_RNG_Control_Registers__DisableOsc1) Disable oscillator rings #32 to #63. Mask */
#define CAM_RNG_Control_Registers__DisableOsc1_DisableOsc1(value) (CAM_RNG_Control_Registers__DisableOsc1_DisableOsc1_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__DisableOsc1_DisableOsc1_Pos)) /* Assignment of value for DisableOsc1 in the CAM_RNG_Control_Registers__DisableOsc1 register */
#define CAM_RNG_Control_Registers__DisableOsc1_Msk _UINT32_(0xFFFFFFFF)                                 /* (CAM_RNG_Control_Registers__DisableOsc1) Register Mask  */


/* -------- CAM_RNG_Control_Registers__SwOffTmrVal : (CAM Offset: 0x11040) (R/W 32) Switch off timer value. -------- */
#define CAM_RNG_Control_Registers__SwOffTmrVal_RESETVALUE _UINT32_(0xFFFF)                                     /*  (CAM_RNG_Control_Registers__SwOffTmrVal) Switch off timer value.  Reset Value */

#define CAM_RNG_Control_Registers__SwOffTmrVal_SwOffTmrVal_Pos _UINT32_(0)                                          /* (CAM_RNG_Control_Registers__SwOffTmrVal) Number of clk cycles to wait before stopping the rings after the FIFO is full. Position */
#define CAM_RNG_Control_Registers__SwOffTmrVal_SwOffTmrVal_Msk (_UINT32_(0xFFFF) << CAM_RNG_Control_Registers__SwOffTmrVal_SwOffTmrVal_Pos) /* (CAM_RNG_Control_Registers__SwOffTmrVal) Number of clk cycles to wait before stopping the rings after the FIFO is full. Mask */
#define CAM_RNG_Control_Registers__SwOffTmrVal_SwOffTmrVal(value) (CAM_RNG_Control_Registers__SwOffTmrVal_SwOffTmrVal_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__SwOffTmrVal_SwOffTmrVal_Pos)) /* Assignment of value for SwOffTmrVal in the CAM_RNG_Control_Registers__SwOffTmrVal register */
#define CAM_RNG_Control_Registers__SwOffTmrVal_Msk _UINT32_(0x0000FFFF)                                 /* (CAM_RNG_Control_Registers__SwOffTmrVal) Register Mask  */


/* -------- CAM_RNG_Control_Registers__ClkDiv : (CAM Offset: 0x11044) (R/W 32) Sample clock divider. -------- */
#define CAM_RNG_Control_Registers__ClkDiv_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_RNG_Control_Registers__ClkDiv) Sample clock divider.  Reset Value */

#define CAM_RNG_Control_Registers__ClkDiv_ClkDiv_Pos _UINT32_(0)                                          /* (CAM_RNG_Control_Registers__ClkDiv) Sample clock divider. The frequency at which the outputs of the rings are sampled is given by: Fs=Fpclk/(ClkDiv+1). Position */
#define CAM_RNG_Control_Registers__ClkDiv_ClkDiv_Msk (_UINT32_(0xFF) << CAM_RNG_Control_Registers__ClkDiv_ClkDiv_Pos) /* (CAM_RNG_Control_Registers__ClkDiv) Sample clock divider. The frequency at which the outputs of the rings are sampled is given by: Fs=Fpclk/(ClkDiv+1). Mask */
#define CAM_RNG_Control_Registers__ClkDiv_ClkDiv(value) (CAM_RNG_Control_Registers__ClkDiv_ClkDiv_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__ClkDiv_ClkDiv_Pos)) /* Assignment of value for ClkDiv in the CAM_RNG_Control_Registers__ClkDiv register */
#define CAM_RNG_Control_Registers__ClkDiv_Msk _UINT32_(0x000000FF)                                 /* (CAM_RNG_Control_Registers__ClkDiv) Register Mask  */


/* -------- CAM_RNG_Control_Registers__AIS31Conf0 : (CAM Offset: 0x11048) (R/W 32) AIS31 configuration register 0. -------- */
#define CAM_RNG_Control_Registers__AIS31Conf0_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_RNG_Control_Registers__AIS31Conf0) AIS31 configuration register 0.  Reset Value */

#define CAM_RNG_Control_Registers__AIS31Conf0_StartUpThreshold_Pos _UINT32_(0)                                          /* (CAM_RNG_Control_Registers__AIS31Conf0) Start-up test threshold. Position */
#define CAM_RNG_Control_Registers__AIS31Conf0_StartUpThreshold_Msk (_UINT32_(0xFFFF) << CAM_RNG_Control_Registers__AIS31Conf0_StartUpThreshold_Pos) /* (CAM_RNG_Control_Registers__AIS31Conf0) Start-up test threshold. Mask */
#define CAM_RNG_Control_Registers__AIS31Conf0_StartUpThreshold(value) (CAM_RNG_Control_Registers__AIS31Conf0_StartUpThreshold_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__AIS31Conf0_StartUpThreshold_Pos)) /* Assignment of value for StartUpThreshold in the CAM_RNG_Control_Registers__AIS31Conf0 register */
#define CAM_RNG_Control_Registers__AIS31Conf0_OnlineThreshold_Pos _UINT32_(16)                                         /* (CAM_RNG_Control_Registers__AIS31Conf0) Online threshold. Position */
#define CAM_RNG_Control_Registers__AIS31Conf0_OnlineThreshold_Msk (_UINT32_(0xFFFF) << CAM_RNG_Control_Registers__AIS31Conf0_OnlineThreshold_Pos) /* (CAM_RNG_Control_Registers__AIS31Conf0) Online threshold. Mask */
#define CAM_RNG_Control_Registers__AIS31Conf0_OnlineThreshold(value) (CAM_RNG_Control_Registers__AIS31Conf0_OnlineThreshold_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__AIS31Conf0_OnlineThreshold_Pos)) /* Assignment of value for OnlineThreshold in the CAM_RNG_Control_Registers__AIS31Conf0 register */
#define CAM_RNG_Control_Registers__AIS31Conf0_Msk _UINT32_(0xFFFFFFFF)                                 /* (CAM_RNG_Control_Registers__AIS31Conf0) Register Mask  */


/* -------- CAM_RNG_Control_Registers__AIS31Conf1 : (CAM Offset: 0x1104C) (R/W 32) AIS31 configuration register 1. -------- */
#define CAM_RNG_Control_Registers__AIS31Conf1_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_RNG_Control_Registers__AIS31Conf1) AIS31 configuration register 1.  Reset Value */

