Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/cam.h
#define CAM_RNG_Control_Registers__AIS31Conf1_OnlineRepThreshold_Pos _UINT32_(0)                                          /* (CAM_RNG_Control_Registers__AIS31Conf1) Online repeat threshold. Position */
#define CAM_RNG_Control_Registers__AIS31Conf1_OnlineRepThreshold_Msk (_UINT32_(0xFFFF) << CAM_RNG_Control_Registers__AIS31Conf1_OnlineRepThreshold_Pos) /* (CAM_RNG_Control_Registers__AIS31Conf1) Online repeat threshold. Mask */
#define CAM_RNG_Control_Registers__AIS31Conf1_OnlineRepThreshold(value) (CAM_RNG_Control_Registers__AIS31Conf1_OnlineRepThreshold_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__AIS31Conf1_OnlineRepThreshold_Pos)) /* Assignment of value for OnlineRepThreshold in the CAM_RNG_Control_Registers__AIS31Conf1 register */
#define CAM_RNG_Control_Registers__AIS31Conf1_HExpectedValue_Pos _UINT32_(16)                                         /* (CAM_RNG_Control_Registers__AIS31Conf1) Expected history value. Position */
#define CAM_RNG_Control_Registers__AIS31Conf1_HExpectedValue_Msk (_UINT32_(0xFFFF) << CAM_RNG_Control_Registers__AIS31Conf1_HExpectedValue_Pos) /* (CAM_RNG_Control_Registers__AIS31Conf1) Expected history value. Mask */
#define CAM_RNG_Control_Registers__AIS31Conf1_HExpectedValue(value) (CAM_RNG_Control_Registers__AIS31Conf1_HExpectedValue_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__AIS31Conf1_HExpectedValue_Pos)) /* Assignment of value for HExpectedValue in the CAM_RNG_Control_Registers__AIS31Conf1 register */
#define CAM_RNG_Control_Registers__AIS31Conf1_Msk _UINT32_(0xFFFFFFFF)                                 /* (CAM_RNG_Control_Registers__AIS31Conf1) Register Mask  */


/* -------- CAM_RNG_Control_Registers__AIS31Conf2 : (CAM Offset: 0x11050) (R/W 32) AIS31 configuration register 2. -------- */
#define CAM_RNG_Control_Registers__AIS31Conf2_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_RNG_Control_Registers__AIS31Conf2) AIS31 configuration register 2.  Reset Value */

#define CAM_RNG_Control_Registers__AIS31Conf2_HMin_Pos _UINT32_(0)                                          /* (CAM_RNG_Control_Registers__AIS31Conf2) Minimum allowed history value. Position */
#define CAM_RNG_Control_Registers__AIS31Conf2_HMin_Msk (_UINT32_(0xFFFF) << CAM_RNG_Control_Registers__AIS31Conf2_HMin_Pos) /* (CAM_RNG_Control_Registers__AIS31Conf2) Minimum allowed history value. Mask */
#define CAM_RNG_Control_Registers__AIS31Conf2_HMin(value) (CAM_RNG_Control_Registers__AIS31Conf2_HMin_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__AIS31Conf2_HMin_Pos)) /* Assignment of value for HMin in the CAM_RNG_Control_Registers__AIS31Conf2 register */
#define CAM_RNG_Control_Registers__AIS31Conf2_HMa_Pos _UINT32_(16)                                         /* (CAM_RNG_Control_Registers__AIS31Conf2) Maximum allowed history value. Position */
#define CAM_RNG_Control_Registers__AIS31Conf2_HMa_Msk (_UINT32_(0xFFFF) << CAM_RNG_Control_Registers__AIS31Conf2_HMa_Pos) /* (CAM_RNG_Control_Registers__AIS31Conf2) Maximum allowed history value. Mask */
#define CAM_RNG_Control_Registers__AIS31Conf2_HMa(value) (CAM_RNG_Control_Registers__AIS31Conf2_HMa_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__AIS31Conf2_HMa_Pos)) /* Assignment of value for HMa in the CAM_RNG_Control_Registers__AIS31Conf2 register */
#define CAM_RNG_Control_Registers__AIS31Conf2_Msk _UINT32_(0xFFFFFFFF)                                 /* (CAM_RNG_Control_Registers__AIS31Conf2) Register Mask  */


/* -------- CAM_RNG_Control_Registers__AIS31Status : (CAM Offset: 0x11054) (R/W 32) AIS31 status register. -------- */
#define CAM_RNG_Control_Registers__AIS31Status_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_RNG_Control_Registers__AIS31Status) AIS31 status register.  Reset Value */

#define CAM_RNG_Control_Registers__AIS31Status_NumPrelimAlarms_Pos _UINT32_(0)                                          /* (CAM_RNG_Control_Registers__AIS31Status) Number of preliminary noise alarms since counter was last cleared. Position */
#define CAM_RNG_Control_Registers__AIS31Status_NumPrelimAlarms_Msk (_UINT32_(0xFFFF) << CAM_RNG_Control_Registers__AIS31Status_NumPrelimAlarms_Pos) /* (CAM_RNG_Control_Registers__AIS31Status) Number of preliminary noise alarms since counter was last cleared. Mask */
#define CAM_RNG_Control_Registers__AIS31Status_NumPrelimAlarms(value) (CAM_RNG_Control_Registers__AIS31Status_NumPrelimAlarms_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__AIS31Status_NumPrelimAlarms_Pos)) /* Assignment of value for NumPrelimAlarms in the CAM_RNG_Control_Registers__AIS31Status register */
#define CAM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRng_Pos _UINT32_(16)                                         /* (CAM_RNG_Control_Registers__AIS31Status) Last preliminary noise alarm occurred due to history value out of range. Position */
#define CAM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRng_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRng_Pos) /* (CAM_RNG_Control_Registers__AIS31Status) Last preliminary noise alarm occurred due to history value out of range. Mask */
#define CAM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRng(value) (CAM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRng_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRng_Pos)) /* Assignment of value for PrelimNoiseAlarmRng in the CAM_RNG_Control_Registers__AIS31Status register */
#define CAM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRep_Pos _UINT32_(17)                                         /* (CAM_RNG_Control_Registers__AIS31Status) Last preliminary noise alarm occurred due to consecutive high X**2. Position */
#define CAM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRep_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRep_Pos) /* (CAM_RNG_Control_Registers__AIS31Status) Last preliminary noise alarm occurred due to consecutive high X**2. Mask */
#define CAM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRep(value) (CAM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRep_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__AIS31Status_PrelimNoiseAlarmRep_Pos)) /* Assignment of value for PrelimNoiseAlarmRep in the CAM_RNG_Control_Registers__AIS31Status register */
#define CAM_RNG_Control_Registers__AIS31Status_Msk _UINT32_(0x0003FFFF)                                 /* (CAM_RNG_Control_Registers__AIS31Status) Register Mask  */


/* -------- CAM_RNG_Control_Registers__HwConfig : (CAM Offset: 0x11058) ( R/ 32) Hardware configuration register. -------- */
#define CAM_RNG_Control_Registers__HwConfig_RESETVALUE _UINT32_(0x37)                                       /*  (CAM_RNG_Control_Registers__HwConfig) Hardware configuration register.  Reset Value */

#define CAM_RNG_Control_Registers__HwConfig_NumbOfRings_Pos _UINT32_(0)                                          /* (CAM_RNG_Control_Registers__HwConfig) Generic g_NumRings value. Position */
#define CAM_RNG_Control_Registers__HwConfig_NumbOfRings_Msk (_UINT32_(0xFF) << CAM_RNG_Control_Registers__HwConfig_NumbOfRings_Pos) /* (CAM_RNG_Control_Registers__HwConfig) Generic g_NumRings value. Mask */
#define CAM_RNG_Control_Registers__HwConfig_NumbOfRings(value) (CAM_RNG_Control_Registers__HwConfig_NumbOfRings_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__HwConfig_NumbOfRings_Pos)) /* Assignment of value for NumbOfRings in the CAM_RNG_Control_Registers__HwConfig register */
#define CAM_RNG_Control_Registers__HwConfig_AIS31_Pos _UINT32_(8)                                          /* (CAM_RNG_Control_Registers__HwConfig) Generic g_AIS31 value. Position */
#define CAM_RNG_Control_Registers__HwConfig_AIS31_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__HwConfig_AIS31_Pos) /* (CAM_RNG_Control_Registers__HwConfig) Generic g_AIS31 value. Mask */
#define CAM_RNG_Control_Registers__HwConfig_AIS31(value) (CAM_RNG_Control_Registers__HwConfig_AIS31_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__HwConfig_AIS31_Pos)) /* Assignment of value for AIS31 in the CAM_RNG_Control_Registers__HwConfig register */
#define CAM_RNG_Control_Registers__HwConfig_AIS31Full_Pos _UINT32_(9)                                          /* (CAM_RNG_Control_Registers__HwConfig) Generic g_AIS31Full value. Position */
#define CAM_RNG_Control_Registers__HwConfig_AIS31Full_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__HwConfig_AIS31Full_Pos) /* (CAM_RNG_Control_Registers__HwConfig) Generic g_AIS31Full value. Mask */
#define CAM_RNG_Control_Registers__HwConfig_AIS31Full(value) (CAM_RNG_Control_Registers__HwConfig_AIS31Full_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__HwConfig_AIS31Full_Pos)) /* Assignment of value for AIS31Full in the CAM_RNG_Control_Registers__HwConfig register */
#define CAM_RNG_Control_Registers__HwConfig_Msk _UINT32_(0x000003FF)                                 /* (CAM_RNG_Control_Registers__HwConfig) Register Mask  */

#define CAM_RNG_Control_Registers__HwConfig_AIS_Pos _UINT32_(8)                                          /* (CAM_RNG_Control_Registers__HwConfig Position) Generic g_AIS3x value. */
#define CAM_RNG_Control_Registers__HwConfig_AIS_Msk (_UINT32_(0x1) << CAM_RNG_Control_Registers__HwConfig_AIS_Pos) /* (CAM_RNG_Control_Registers__HwConfig Mask) AIS */
#define CAM_RNG_Control_Registers__HwConfig_AIS(value) (CAM_RNG_Control_Registers__HwConfig_AIS_Msk & (_UINT32_(value) << CAM_RNG_Control_Registers__HwConfig_AIS_Pos)) 

/* -------- CAM_PK_Registers__Pointers : (CAM Offset: 0x12000) (R/W 32) Pointers register. -------- */
#define CAM_PK_Registers__Pointers_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_PK_Registers__Pointers) Pointers register.  Reset Value */

#define CAM_PK_Registers__Pointers_OpPtrA_Pos _UINT32_(0)                                          /* (CAM_PK_Registers__Pointers) When executing primitive arithmetic operations, this pointer defines where operand A is located in memory (location 0x0 to 0xF). Position */
#define CAM_PK_Registers__Pointers_OpPtrA_Msk (_UINT32_(0xF) << CAM_PK_Registers__Pointers_OpPtrA_Pos) /* (CAM_PK_Registers__Pointers) When executing primitive arithmetic operations, this pointer defines where operand A is located in memory (location 0x0 to 0xF). Mask */
#define CAM_PK_Registers__Pointers_OpPtrA(value) (CAM_PK_Registers__Pointers_OpPtrA_Msk & (_UINT32_(value) << CAM_PK_Registers__Pointers_OpPtrA_Pos)) /* Assignment of value for OpPtrA in the CAM_PK_Registers__Pointers register */
#define CAM_PK_Registers__Pointers_OpPtrB_Pos _UINT32_(8)                                          /* (CAM_PK_Registers__Pointers) When executing primitive arithmetic operations, this pointer defines where operand B is located in memory (location 0x0 to 0xF). Position */
#define CAM_PK_Registers__Pointers_OpPtrB_Msk (_UINT32_(0xF) << CAM_PK_Registers__Pointers_OpPtrB_Pos) /* (CAM_PK_Registers__Pointers) When executing primitive arithmetic operations, this pointer defines where operand B is located in memory (location 0x0 to 0xF). Mask */
#define CAM_PK_Registers__Pointers_OpPtrB(value) (CAM_PK_Registers__Pointers_OpPtrB_Msk & (_UINT32_(value) << CAM_PK_Registers__Pointers_OpPtrB_Pos)) /* Assignment of value for OpPtrB in the CAM_PK_Registers__Pointers register */
#define CAM_PK_Registers__Pointers_OpPtrC_Pos _UINT32_(16)                                         /* (CAM_PK_Registers__Pointers) When executing primitive arithmetic operations, this pointer defines the location (0x0 to 0xF) where the result will be stored in memory. Position */
#define CAM_PK_Registers__Pointers_OpPtrC_Msk (_UINT32_(0xF) << CAM_PK_Registers__Pointers_OpPtrC_Pos) /* (CAM_PK_Registers__Pointers) When executing primitive arithmetic operations, this pointer defines the location (0x0 to 0xF) where the result will be stored in memory. Mask */
#define CAM_PK_Registers__Pointers_OpPtrC(value) (CAM_PK_Registers__Pointers_OpPtrC_Msk & (_UINT32_(value) << CAM_PK_Registers__Pointers_OpPtrC_Pos)) /* Assignment of value for OpPtrC in the CAM_PK_Registers__Pointers register */
#define CAM_PK_Registers__Pointers_OpPtrN_Pos _UINT32_(24)                                         /* (CAM_PK_Registers__Pointers) When executing primitive arithmetic operations, this pointer defines the location where the modulus is located in memory (location 0x0 to 0xF). Position */
#define CAM_PK_Registers__Pointers_OpPtrN_Msk (_UINT32_(0xF) << CAM_PK_Registers__Pointers_OpPtrN_Pos) /* (CAM_PK_Registers__Pointers) When executing primitive arithmetic operations, this pointer defines the location where the modulus is located in memory (location 0x0 to 0xF). Mask */
#define CAM_PK_Registers__Pointers_OpPtrN(value) (CAM_PK_Registers__Pointers_OpPtrN_Msk & (_UINT32_(value) << CAM_PK_Registers__Pointers_OpPtrN_Pos)) /* Assignment of value for OpPtrN in the CAM_PK_Registers__Pointers register */
#define CAM_PK_Registers__Pointers_Msk        _UINT32_(0x0F0F0F0F)                                 /* (CAM_PK_Registers__Pointers) Register Mask  */


