Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/cam.h
/* -------- CAM_PK_Registers__Command : (CAM Offset: 0x12004) (R/W 32) Command register. -------- */
#define CAM_PK_Registers__Command_RESETVALUE  _UINT32_(0x0F)                                       /*  (CAM_PK_Registers__Command) Command register.  Reset Value */

#define CAM_PK_Registers__Command_OpeAddr_Pos _UINT32_(0)                                          /* (CAM_PK_Registers__Command) This field defines the operation to be performed. See documentation for more details. Position */
#define CAM_PK_Registers__Command_OpeAddr_Msk (_UINT32_(0x7F) << CAM_PK_Registers__Command_OpeAddr_Pos) /* (CAM_PK_Registers__Command) This field defines the operation to be performed. See documentation for more details. Mask */
#define CAM_PK_Registers__Command_OpeAddr(value) (CAM_PK_Registers__Command_OpeAddr_Msk & (_UINT32_(value) << CAM_PK_Registers__Command_OpeAddr_Pos)) /* Assignment of value for OpeAddr in the CAM_PK_Registers__Command register */
#define CAM_PK_Registers__Command_FieldF_Pos  _UINT32_(7)                                          /* (CAM_PK_Registers__Command) '0': Field is GF(p) '1': Field is GF(2**m) Position */
#define CAM_PK_Registers__Command_FieldF_Msk  (_UINT32_(0x1) << CAM_PK_Registers__Command_FieldF_Pos) /* (CAM_PK_Registers__Command) '0': Field is GF(p) '1': Field is GF(2**m) Mask */
#define CAM_PK_Registers__Command_FieldF(value) (CAM_PK_Registers__Command_FieldF_Msk & (_UINT32_(value) << CAM_PK_Registers__Command_FieldF_Pos)) /* Assignment of value for FieldF in the CAM_PK_Registers__Command register */
#define CAM_PK_Registers__Command_OpBytesM1_Pos _UINT32_(8)                                          /* (CAM_PK_Registers__Command) This field defines the size (= number of bytes minus one) of the operands for the current operation. Possible values are limited by the maximum supported operand size. Examples: - 0x014 -> ECC on curve K-163 - 0x01F -> ECC on curve P-256 - 0x02F -> ECC on curve P-384 - 0x033 -> ECC on curve K-409 - 0x041 -> ECC on curve P-521 - 0x07F -> 1024-bit RSA - 0x09F -> 1280-bit RSA - 0x1FF -> 4096-bit RSA - 0x3FF -> 8192-bit RSA Position */
#define CAM_PK_Registers__Command_OpBytesM1_Msk (_UINT32_(0x3FF) << CAM_PK_Registers__Command_OpBytesM1_Pos) /* (CAM_PK_Registers__Command) This field defines the size (= number of bytes minus one) of the operands for the current operation. Possible values are limited by the maximum supported operand size. Examples: - 0x014 -> ECC on curve K-163 - 0x01F -> ECC on curve P-256 - 0x02F -> ECC on curve P-384 - 0x033 -> ECC on curve K-409 - 0x041 -> ECC on curve P-521 - 0x07F -> 1024-bit RSA - 0x09F -> 1280-bit RSA - 0x1FF -> 4096-bit RSA - 0x3FF -> 8192-bit RSA Mask */
#define CAM_PK_Registers__Command_OpBytesM1(value) (CAM_PK_Registers__Command_OpBytesM1_Msk & (_UINT32_(value) << CAM_PK_Registers__Command_OpBytesM1_Pos)) /* Assignment of value for OpBytesM1 in the CAM_PK_Registers__Command register */
#define CAM_PK_Registers__Command_RandMod_Pos _UINT32_(19)                                         /* (CAM_PK_Registers__Command) Enable randomization of modulus (counter-measure). Position */
#define CAM_PK_Registers__Command_RandMod_Msk (_UINT32_(0x1) << CAM_PK_Registers__Command_RandMod_Pos) /* (CAM_PK_Registers__Command) Enable randomization of modulus (counter-measure). Mask */
#define CAM_PK_Registers__Command_RandMod(value) (CAM_PK_Registers__Command_RandMod_Msk & (_UINT32_(value) << CAM_PK_Registers__Command_RandMod_Pos)) /* Assignment of value for RandMod in the CAM_PK_Registers__Command register */
#define CAM_PK_Registers__Command_SelCurve_Pos _UINT32_(20)                                         /* (CAM_PK_Registers__Command) Enable accelerator for specific curve modulus: 0x0: No acceleration (default) 0x1: P256 0x2: P384 0x3: P521 0x4: P192 0x5: Curve25519 0x6: Ed25519 This field has no effect when the optional acceleration hardware is not included. Position */
#define CAM_PK_Registers__Command_SelCurve_Msk (_UINT32_(0x7) << CAM_PK_Registers__Command_SelCurve_Pos) /* (CAM_PK_Registers__Command) Enable accelerator for specific curve modulus: 0x0: No acceleration (default) 0x1: P256 0x2: P384 0x3: P521 0x4: P192 0x5: Curve25519 0x6: Ed25519 This field has no effect when the optional acceleration hardware is not included. Mask */
#define CAM_PK_Registers__Command_SelCurve(value) (CAM_PK_Registers__Command_SelCurve_Msk & (_UINT32_(value) << CAM_PK_Registers__Command_SelCurve_Pos)) /* Assignment of value for SelCurve in the CAM_PK_Registers__Command register */
#define CAM_PK_Registers__Command_RandKE_Pos  _UINT32_(24)                                         /* (CAM_PK_Registers__Command) Enable randomization of exponent/scalar (counter-measure). Position */
#define CAM_PK_Registers__Command_RandKE_Msk  (_UINT32_(0x1) << CAM_PK_Registers__Command_RandKE_Pos) /* (CAM_PK_Registers__Command) Enable randomization of exponent/scalar (counter-measure). Mask */
#define CAM_PK_Registers__Command_RandKE(value) (CAM_PK_Registers__Command_RandKE_Msk & (_UINT32_(value) << CAM_PK_Registers__Command_RandKE_Pos)) /* Assignment of value for RandKE in the CAM_PK_Registers__Command register */
#define CAM_PK_Registers__Command_RandProj_Pos _UINT32_(25)                                         /* (CAM_PK_Registers__Command) Enable randomization of projective coordinates (counter-measure). Position */
#define CAM_PK_Registers__Command_RandProj_Msk (_UINT32_(0x1) << CAM_PK_Registers__Command_RandProj_Pos) /* (CAM_PK_Registers__Command) Enable randomization of projective coordinates (counter-measure). Mask */
#define CAM_PK_Registers__Command_RandProj(value) (CAM_PK_Registers__Command_RandProj_Msk & (_UINT32_(value) << CAM_PK_Registers__Command_RandProj_Pos)) /* Assignment of value for RandProj in the CAM_PK_Registers__Command register */
#define CAM_PK_Registers__Command_Edwards_Pos _UINT32_(26)                                         /* (CAM_PK_Registers__Command) Enable Edwards curve (see operation description). Position */
#define CAM_PK_Registers__Command_Edwards_Msk (_UINT32_(0x1) << CAM_PK_Registers__Command_Edwards_Pos) /* (CAM_PK_Registers__Command) Enable Edwards curve (see operation description). Mask */
#define CAM_PK_Registers__Command_Edwards(value) (CAM_PK_Registers__Command_Edwards_Msk & (_UINT32_(value) << CAM_PK_Registers__Command_Edwards_Pos)) /* Assignment of value for Edwards in the CAM_PK_Registers__Command register */
#define CAM_PK_Registers__Command_SwapBytes_Pos _UINT32_(28)                                         /* (CAM_PK_Registers__Command) Swap the bytes on AHB interface: '0': Native format (little endian) '1': Byte swapped (big endian) See also section 4.2.1. This bit must be programmed before writing/reading any data in data memory. Position */
#define CAM_PK_Registers__Command_SwapBytes_Msk (_UINT32_(0x1) << CAM_PK_Registers__Command_SwapBytes_Pos) /* (CAM_PK_Registers__Command) Swap the bytes on AHB interface: '0': Native format (little endian) '1': Byte swapped (big endian) See also section 4.2.1. This bit must be programmed before writing/reading any data in data memory. Mask */
#define CAM_PK_Registers__Command_SwapBytes(value) (CAM_PK_Registers__Command_SwapBytes_Msk & (_UINT32_(value) << CAM_PK_Registers__Command_SwapBytes_Pos)) /* Assignment of value for SwapBytes in the CAM_PK_Registers__Command register */
#define CAM_PK_Registers__Command_FlagA_Pos   _UINT32_(29)                                         /* (CAM_PK_Registers__Command) See operation description. Position */
#define CAM_PK_Registers__Command_FlagA_Msk   (_UINT32_(0x1) << CAM_PK_Registers__Command_FlagA_Pos) /* (CAM_PK_Registers__Command) See operation description. Mask */
#define CAM_PK_Registers__Command_FlagA(value) (CAM_PK_Registers__Command_FlagA_Msk & (_UINT32_(value) << CAM_PK_Registers__Command_FlagA_Pos)) /* Assignment of value for FlagA in the CAM_PK_Registers__Command register */
#define CAM_PK_Registers__Command_FlagB_Pos   _UINT32_(30)                                         /* (CAM_PK_Registers__Command) See operation description. Position */
#define CAM_PK_Registers__Command_FlagB_Msk   (_UINT32_(0x1) << CAM_PK_Registers__Command_FlagB_Pos) /* (CAM_PK_Registers__Command) See operation description. Mask */
#define CAM_PK_Registers__Command_FlagB(value) (CAM_PK_Registers__Command_FlagB_Msk & (_UINT32_(value) << CAM_PK_Registers__Command_FlagB_Pos)) /* Assignment of value for FlagB in the CAM_PK_Registers__Command register */
#define CAM_PK_Registers__Command_CalcR2_Pos  _UINT32_(31)                                         /* (CAM_PK_Registers__Command) This bit indicates if the IP has to calculate R**2 mod N for the next operation. This bit must be set to '1' when a new prime number has been programmed. This bit is used for primitive operations and ignored for the other operations. '0': don't recalculate R**2 mod N '1': re-calculate R**2 mod N Position */
#define CAM_PK_Registers__Command_CalcR2_Msk  (_UINT32_(0x1) << CAM_PK_Registers__Command_CalcR2_Pos) /* (CAM_PK_Registers__Command) This bit indicates if the IP has to calculate R**2 mod N for the next operation. This bit must be set to '1' when a new prime number has been programmed. This bit is used for primitive operations and ignored for the other operations. '0': don't recalculate R**2 mod N '1': re-calculate R**2 mod N Mask */
#define CAM_PK_Registers__Command_CalcR2(value) (CAM_PK_Registers__Command_CalcR2_Msk & (_UINT32_(value) << CAM_PK_Registers__Command_CalcR2_Pos)) /* Assignment of value for CalcR2 in the CAM_PK_Registers__Command register */
#define CAM_PK_Registers__Command_Msk         _UINT32_(0xF77BFFFF)                                 /* (CAM_PK_Registers__Command) Register Mask  */

#define CAM_PK_Registers__Command_CalcR_Pos   _UINT32_(31)                                         /* (CAM_PK_Registers__Command Position) This bit indicates if the IP has to calculate R**2 mod N for the next operation. This bit must be set to 'x' when a new prime number has been programmed. This bit is used for primitive operations and ignored for the other operations. 'x': don't recalculate R**2 mod N 'x': re-calculate R**2 mod N */
#define CAM_PK_Registers__Command_CalcR_Msk   (_UINT32_(0x1) << CAM_PK_Registers__Command_CalcR_Pos) /* (CAM_PK_Registers__Command Mask) CalcR */
#define CAM_PK_Registers__Command_CalcR(value) (CAM_PK_Registers__Command_CalcR_Msk & (_UINT32_(value) << CAM_PK_Registers__Command_CalcR_Pos)) 

/* -------- CAM_PK_Registers__Control : (CAM Offset: 0x12008) ( /W 32) Command register. -------- */
#define CAM_PK_Registers__Control_RESETVALUE  _UINT32_(0x00)                                       /*  (CAM_PK_Registers__Control) Command register.  Reset Value */

#define CAM_PK_Registers__Control_Start_Pos   _UINT32_(0)                                          /* (CAM_PK_Registers__Control) Writing a '1' starts the processing. Position */
#define CAM_PK_Registers__Control_Start_Msk   (_UINT32_(0x1) << CAM_PK_Registers__Control_Start_Pos) /* (CAM_PK_Registers__Control) Writing a '1' starts the processing. Mask */
#define CAM_PK_Registers__Control_Start(value) (CAM_PK_Registers__Control_Start_Msk & (_UINT32_(value) << CAM_PK_Registers__Control_Start_Pos)) /* Assignment of value for Start in the CAM_PK_Registers__Control register */
#define CAM_PK_Registers__Control_ClearIRQ_Pos _UINT32_(1)                                          /* (CAM_PK_Registers__Control) Writing a '1' clears the IRQ output. Position */
#define CAM_PK_Registers__Control_ClearIRQ_Msk (_UINT32_(0x1) << CAM_PK_Registers__Control_ClearIRQ_Pos) /* (CAM_PK_Registers__Control) Writing a '1' clears the IRQ output. Mask */
#define CAM_PK_Registers__Control_ClearIRQ(value) (CAM_PK_Registers__Control_ClearIRQ_Msk & (_UINT32_(value) << CAM_PK_Registers__Control_ClearIRQ_Pos)) /* Assignment of value for ClearIRQ in the CAM_PK_Registers__Control register */
#define CAM_PK_Registers__Control_Msk         _UINT32_(0x00000003)                                 /* (CAM_PK_Registers__Control) Register Mask  */


