Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/cam.h
/* -------- CAM_PK_Registers__Status : (CAM Offset: 0x1200C) ( R/ 32) Status register. -------- */
#define CAM_PK_Registers__Status_RESETVALUE   _UINT32_(0x00)                                       /*  (CAM_PK_Registers__Status) Status register.  Reset Value */

#define CAM_PK_Registers__Status_ErrorFlags_Pos _UINT32_(4)                                          /* (CAM_PK_Registers__Status) These bits indicate an error condition. They are updated at the end of the operation. They are cleared when starting a new operation. See documentation for more details. Position */
#define CAM_PK_Registers__Status_ErrorFlags_Msk (_UINT32_(0xFFF) << CAM_PK_Registers__Status_ErrorFlags_Pos) /* (CAM_PK_Registers__Status) These bits indicate an error condition. They are updated at the end of the operation. They are cleared when starting a new operation. See documentation for more details. Mask */
#define CAM_PK_Registers__Status_ErrorFlags(value) (CAM_PK_Registers__Status_ErrorFlags_Msk & (_UINT32_(value) << CAM_PK_Registers__Status_ErrorFlags_Pos)) /* Assignment of value for ErrorFlags in the CAM_PK_Registers__Status register */
#define CAM_PK_Registers__Status_PK_Busy_Pos  _UINT32_(16)                                         /* (CAM_PK_Registers__Status) This bit reflects the BUSY output value. It is set when the operation starts and it is cleared when the operation is finished. Position */
#define CAM_PK_Registers__Status_PK_Busy_Msk  (_UINT32_(0x1) << CAM_PK_Registers__Status_PK_Busy_Pos) /* (CAM_PK_Registers__Status) This bit reflects the BUSY output value. It is set when the operation starts and it is cleared when the operation is finished. Mask */
#define CAM_PK_Registers__Status_PK_Busy(value) (CAM_PK_Registers__Status_PK_Busy_Msk & (_UINT32_(value) << CAM_PK_Registers__Status_PK_Busy_Pos)) /* Assignment of value for PK_Busy in the CAM_PK_Registers__Status register */
#define CAM_PK_Registers__Status_IntrptStatus_Pos _UINT32_(17)                                         /* (CAM_PK_Registers__Status) This bit reflects the IRQ output value. It is set when the operation is finished. It is cleared when the CPU writes the bit 1 of Control Register. Position */
#define CAM_PK_Registers__Status_IntrptStatus_Msk (_UINT32_(0x1) << CAM_PK_Registers__Status_IntrptStatus_Pos) /* (CAM_PK_Registers__Status) This bit reflects the IRQ output value. It is set when the operation is finished. It is cleared when the CPU writes the bit 1 of Control Register. Mask */
#define CAM_PK_Registers__Status_IntrptStatus(value) (CAM_PK_Registers__Status_IntrptStatus_Msk & (_UINT32_(value) << CAM_PK_Registers__Status_IntrptStatus_Pos)) /* Assignment of value for IntrptStatus in the CAM_PK_Registers__Status register */
#define CAM_PK_Registers__Status_FailPtr_Pos  _UINT32_(24)                                         /* (CAM_PK_Registers__Status) These bits indicate which data location generated the error flag. They are not available for all error flags. Position */
#define CAM_PK_Registers__Status_FailPtr_Msk  (_UINT32_(0x1F) << CAM_PK_Registers__Status_FailPtr_Pos) /* (CAM_PK_Registers__Status) These bits indicate which data location generated the error flag. They are not available for all error flags. Mask */
#define CAM_PK_Registers__Status_FailPtr(value) (CAM_PK_Registers__Status_FailPtr_Msk & (_UINT32_(value) << CAM_PK_Registers__Status_FailPtr_Pos)) /* Assignment of value for FailPtr in the CAM_PK_Registers__Status register */
#define CAM_PK_Registers__Status_Msk          _UINT32_(0x1F03FFF0)                                 /* (CAM_PK_Registers__Status) Register Mask  */


/* -------- CAM_PK_Registers__Timer : (CAM Offset: 0x12014) (R/W 32) Timer register. -------- */
#define CAM_PK_Registers__Timer_RESETVALUE    _UINT32_(0x00)                                       /*  (CAM_PK_Registers__Timer) Timer register.  Reset Value */

#define CAM_PK_Registers__Timer_Timer_Pos     _UINT32_(1)                                          /* (CAM_PK_Registers__Timer) Number of core clock cycles. Position */
#define CAM_PK_Registers__Timer_Timer_Msk     (_UINT32_(0x7FFFFFFF) << CAM_PK_Registers__Timer_Timer_Pos) /* (CAM_PK_Registers__Timer) Number of core clock cycles. Mask */
#define CAM_PK_Registers__Timer_Timer(value)  (CAM_PK_Registers__Timer_Timer_Msk & (_UINT32_(value) << CAM_PK_Registers__Timer_Timer_Pos)) /* Assignment of value for Timer in the CAM_PK_Registers__Timer register */
#define CAM_PK_Registers__Timer_Msk           _UINT32_(0xFFFFFFFE)                                 /* (CAM_PK_Registers__Timer) Register Mask  */


/* -------- CAM_PK_Registers__HwConfig : (CAM Offset: 0x12018) ( R/ 32) Hardware configuration register. -------- */
#define CAM_PK_Registers__HwConfig_RESETVALUE _UINT32_(0x43F30200)                                 /*  (CAM_PK_Registers__HwConfig) Hardware configuration register.  Reset Value */

#define CAM_PK_Registers__HwConfig_MaxOpSize_Pos _UINT32_(0)                                          /* (CAM_PK_Registers__HwConfig) Maximum operand size (number of bytes). Position */
#define CAM_PK_Registers__HwConfig_MaxOpSize_Msk (_UINT32_(0xFFF) << CAM_PK_Registers__HwConfig_MaxOpSize_Pos) /* (CAM_PK_Registers__HwConfig) Maximum operand size (number of bytes). Mask */
#define CAM_PK_Registers__HwConfig_MaxOpSize(value) (CAM_PK_Registers__HwConfig_MaxOpSize_Msk & (_UINT32_(value) << CAM_PK_Registers__HwConfig_MaxOpSize_Pos)) /* Assignment of value for MaxOpSize in the CAM_PK_Registers__HwConfig register */
#define CAM_PK_Registers__HwConfig_NbMult_Pos _UINT32_(12)                                         /* (CAM_PK_Registers__HwConfig) Number of multipliers: 0x0: 1 multiplier 0x1: 4 multipliers 0x2: 16 multipliers 0x4: 64 multipliers 0x8: 256 multipliers Position */
#define CAM_PK_Registers__HwConfig_NbMult_Msk (_UINT32_(0xF) << CAM_PK_Registers__HwConfig_NbMult_Pos) /* (CAM_PK_Registers__HwConfig) Number of multipliers: 0x0: 1 multiplier 0x1: 4 multipliers 0x2: 16 multipliers 0x4: 64 multipliers 0x8: 256 multipliers Mask */
#define CAM_PK_Registers__HwConfig_NbMult(value) (CAM_PK_Registers__HwConfig_NbMult_Msk & (_UINT32_(value) << CAM_PK_Registers__HwConfig_NbMult_Pos)) /* Assignment of value for NbMult in the CAM_PK_Registers__HwConfig register */
#define CAM_PK_Registers__HwConfig_PrimeField_Pos _UINT32_(16)                                         /* (CAM_PK_Registers__HwConfig) Support prime field. Position */
#define CAM_PK_Registers__HwConfig_PrimeField_Msk (_UINT32_(0x1) << CAM_PK_Registers__HwConfig_PrimeField_Pos) /* (CAM_PK_Registers__HwConfig) Support prime field. Mask */
#define CAM_PK_Registers__HwConfig_PrimeField(value) (CAM_PK_Registers__HwConfig_PrimeField_Msk & (_UINT32_(value) << CAM_PK_Registers__HwConfig_PrimeField_Pos)) /* Assignment of value for PrimeField in the CAM_PK_Registers__HwConfig register */
#define CAM_PK_Registers__HwConfig_BinaryField_Pos _UINT32_(17)                                         /* (CAM_PK_Registers__HwConfig) Support binary field. Position */
#define CAM_PK_Registers__HwConfig_BinaryField_Msk (_UINT32_(0x1) << CAM_PK_Registers__HwConfig_BinaryField_Pos) /* (CAM_PK_Registers__HwConfig) Support binary field. Mask */
#define CAM_PK_Registers__HwConfig_BinaryField(value) (CAM_PK_Registers__HwConfig_BinaryField_Msk & (_UINT32_(value) << CAM_PK_Registers__HwConfig_BinaryField_Pos)) /* Assignment of value for BinaryField in the CAM_PK_Registers__HwConfig register */
#define CAM_PK_Registers__HwConfig_ECC_Pos    _UINT32_(18)                                         /* (CAM_PK_Registers__HwConfig) Support RAM error correction. Position */
#define CAM_PK_Registers__HwConfig_ECC_Msk    (_UINT32_(0x1) << CAM_PK_Registers__HwConfig_ECC_Pos) /* (CAM_PK_Registers__HwConfig) Support RAM error correction. Mask */
#define CAM_PK_Registers__HwConfig_ECC(value) (CAM_PK_Registers__HwConfig_ECC_Msk & (_UINT32_(value) << CAM_PK_Registers__HwConfig_ECC_Pos)) /* Assignment of value for ECC in the CAM_PK_Registers__HwConfig register */
#define CAM_PK_Registers__HwConfig_P256_Pos   _UINT32_(20)                                         /* (CAM_PK_Registers__HwConfig) Support ECC P256 acceleration. Position */
#define CAM_PK_Registers__HwConfig_P256_Msk   (_UINT32_(0x1) << CAM_PK_Registers__HwConfig_P256_Pos) /* (CAM_PK_Registers__HwConfig) Support ECC P256 acceleration. Mask */
#define CAM_PK_Registers__HwConfig_P256(value) (CAM_PK_Registers__HwConfig_P256_Msk & (_UINT32_(value) << CAM_PK_Registers__HwConfig_P256_Pos)) /* Assignment of value for P256 in the CAM_PK_Registers__HwConfig register */
#define CAM_PK_Registers__HwConfig_P384_Pos   _UINT32_(21)                                         /* (CAM_PK_Registers__HwConfig) Support ECC P384 acceleration. Position */
#define CAM_PK_Registers__HwConfig_P384_Msk   (_UINT32_(0x1) << CAM_PK_Registers__HwConfig_P384_Pos) /* (CAM_PK_Registers__HwConfig) Support ECC P384 acceleration. Mask */
#define CAM_PK_Registers__HwConfig_P384(value) (CAM_PK_Registers__HwConfig_P384_Msk & (_UINT32_(value) << CAM_PK_Registers__HwConfig_P384_Pos)) /* Assignment of value for P384 in the CAM_PK_Registers__HwConfig register */
#define CAM_PK_Registers__HwConfig_P521_Pos   _UINT32_(22)                                         /* (CAM_PK_Registers__HwConfig) Support ECC P521 acceleration. Position */
#define CAM_PK_Registers__HwConfig_P521_Msk   (_UINT32_(0x1) << CAM_PK_Registers__HwConfig_P521_Pos) /* (CAM_PK_Registers__HwConfig) Support ECC P521 acceleration. Mask */
#define CAM_PK_Registers__HwConfig_P521(value) (CAM_PK_Registers__HwConfig_P521_Msk & (_UINT32_(value) << CAM_PK_Registers__HwConfig_P521_Pos)) /* Assignment of value for P521 in the CAM_PK_Registers__HwConfig register */
#define CAM_PK_Registers__HwConfig_P192_Pos   _UINT32_(23)                                         /* (CAM_PK_Registers__HwConfig) Support ECC P192 acceleration. Position */
#define CAM_PK_Registers__HwConfig_P192_Msk   (_UINT32_(0x1) << CAM_PK_Registers__HwConfig_P192_Pos) /* (CAM_PK_Registers__HwConfig) Support ECC P192 acceleration. Mask */
#define CAM_PK_Registers__HwConfig_P192(value) (CAM_PK_Registers__HwConfig_P192_Msk & (_UINT32_(value) << CAM_PK_Registers__HwConfig_P192_Pos)) /* Assignment of value for P192 in the CAM_PK_Registers__HwConfig register */
#define CAM_PK_Registers__HwConfig_X25519_Pos _UINT32_(24)                                         /* (CAM_PK_Registers__HwConfig) Support Curve25519/Ed25519 acceleration. Position */
#define CAM_PK_Registers__HwConfig_X25519_Msk (_UINT32_(0x1) << CAM_PK_Registers__HwConfig_X25519_Pos) /* (CAM_PK_Registers__HwConfig) Support Curve25519/Ed25519 acceleration. Mask */
#define CAM_PK_Registers__HwConfig_X25519(value) (CAM_PK_Registers__HwConfig_X25519_Msk & (_UINT32_(value) << CAM_PK_Registers__HwConfig_X25519_Pos)) /* Assignment of value for X25519 in the CAM_PK_Registers__HwConfig register */
#define CAM_PK_Registers__HwConfig_AHBMaster_Pos _UINT32_(25)                                         /* (CAM_PK_Registers__HwConfig) '0': Memory access through AHB Slave and internally in the PKE.                                                                             '1': Memory access through AHB Master, outside the PKE. Position */
#define CAM_PK_Registers__HwConfig_AHBMaster_Msk (_UINT32_(0x1) << CAM_PK_Registers__HwConfig_AHBMaster_Pos) /* (CAM_PK_Registers__HwConfig) '0': Memory access through AHB Slave and internally in the PKE.                                                                             '1': Memory access through AHB Master, outside the PKE. Mask */
#define CAM_PK_Registers__HwConfig_AHBMaster(value) (CAM_PK_Registers__HwConfig_AHBMaster_Msk & (_UINT32_(value) << CAM_PK_Registers__HwConfig_AHBMaster_Pos)) /* Assignment of value for AHBMaster in the CAM_PK_Registers__HwConfig register */
#define CAM_PK_Registers__HwConfig_DisableSM_Pos _UINT32_(29)                                         /* (CAM_PK_Registers__HwConfig) State of DisableSMx input (high when SM2/SM9 operations are disabled). Position */
#define CAM_PK_Registers__HwConfig_DisableSM_Msk (_UINT32_(0x1) << CAM_PK_Registers__HwConfig_DisableSM_Pos) /* (CAM_PK_Registers__HwConfig) State of DisableSMx input (high when SM2/SM9 operations are disabled). Mask */
#define CAM_PK_Registers__HwConfig_DisableSM(value) (CAM_PK_Registers__HwConfig_DisableSM_Msk & (_UINT32_(value) << CAM_PK_Registers__HwConfig_DisableSM_Pos)) /* Assignment of value for DisableSM in the CAM_PK_Registers__HwConfig register */
#define CAM_PK_Registers__HwConfig_DisableClrMem_Pos _UINT32_(30)                                         /* (CAM_PK_Registers__HwConfig) State of DisableClrMem input (high when automatic clear of the RAM after reset is disabled). Position */
#define CAM_PK_Registers__HwConfig_DisableClrMem_Msk (_UINT32_(0x1) << CAM_PK_Registers__HwConfig_DisableClrMem_Pos) /* (CAM_PK_Registers__HwConfig) State of DisableClrMem input (high when automatic clear of the RAM after reset is disabled). Mask */
#define CAM_PK_Registers__HwConfig_DisableClrMem(value) (CAM_PK_Registers__HwConfig_DisableClrMem_Msk & (_UINT32_(value) << CAM_PK_Registers__HwConfig_DisableClrMem_Pos)) /* Assignment of value for DisableClrMem in the CAM_PK_Registers__HwConfig register */
#define CAM_PK_Registers__HwConfig_DisableCM_Pos _UINT32_(31)                                         /* (CAM_PK_Registers__HwConfig) State of DisableCM input (high when counter-measures are disabled). Position */
#define CAM_PK_Registers__HwConfig_DisableCM_Msk (_UINT32_(0x1) << CAM_PK_Registers__HwConfig_DisableCM_Pos) /* (CAM_PK_Registers__HwConfig) State of DisableCM input (high when counter-measures are disabled). Mask */
#define CAM_PK_Registers__HwConfig_DisableCM(value) (CAM_PK_Registers__HwConfig_DisableCM_Msk & (_UINT32_(value) << CAM_PK_Registers__HwConfig_DisableCM_Pos)) /* Assignment of value for DisableCM in the CAM_PK_Registers__HwConfig register */
#define CAM_PK_Registers__HwConfig_Msk        _UINT32_(0xE3F7FFFF)                                 /* (CAM_PK_Registers__HwConfig) Register Mask  */

#define CAM_PK_Registers__HwConfig_P_Pos      _UINT32_(20)                                         /* (CAM_PK_Registers__HwConfig Position) Support ECC P256 acceleration. */
#define CAM_PK_Registers__HwConfig_P_Msk      (_UINT32_(0xF) << CAM_PK_Registers__HwConfig_P_Pos)  /* (CAM_PK_Registers__HwConfig Mask) P */
#define CAM_PK_Registers__HwConfig_P(value)   (CAM_PK_Registers__HwConfig_P_Msk & (_UINT32_(value) << CAM_PK_Registers__HwConfig_P_Pos)) 
#define CAM_PK_Registers__HwConfig_X_Pos      _UINT32_(24)                                         /* (CAM_PK_Registers__HwConfig Position) Support Curve255x9/Ed255x9 acceleration. */
#define CAM_PK_Registers__HwConfig_X_Msk      (_UINT32_(0x1) << CAM_PK_Registers__HwConfig_X_Pos)  /* (CAM_PK_Registers__HwConfig Mask) X */
#define CAM_PK_Registers__HwConfig_X(value)   (CAM_PK_Registers__HwConfig_X_Msk & (_UINT32_(value) << CAM_PK_Registers__HwConfig_X_Pos)) 

/* -------- CAM_PK_Registers__OpSize : (CAM Offset: 0x1201C) (R/W 32) Operand size register. -------- */
#define CAM_PK_Registers__OpSize_RESETVALUE   _UINT32_(0x1000)                                     /*  (CAM_PK_Registers__OpSize) Operand size register.  Reset Value */

#define CAM_PK_Registers__OpSize_OpSize_Pos   _UINT32_(0)                                          /* (CAM_PK_Registers__OpSize) Operand size (number of bytes): 0x0100: 256 0x0209: 521 0x0800: 2048 0x0C00: 3072 0x1000: 4096 This register is used when the memory is accessed via AHB Master Position */
#define CAM_PK_Registers__OpSize_OpSize_Msk   (_UINT32_(0x1FFF) << CAM_PK_Registers__OpSize_OpSize_Pos) /* (CAM_PK_Registers__OpSize) Operand size (number of bytes): 0x0100: 256 0x0209: 521 0x0800: 2048 0x0C00: 3072 0x1000: 4096 This register is used when the memory is accessed via AHB Master Mask */
#define CAM_PK_Registers__OpSize_OpSize(value) (CAM_PK_Registers__OpSize_OpSize_Msk & (_UINT32_(value) << CAM_PK_Registers__OpSize_OpSize_Pos)) /* Assignment of value for OpSize in the CAM_PK_Registers__OpSize register */
#define CAM_PK_Registers__OpSize_Msk          _UINT32_(0x00001FFF)                                 /* (CAM_PK_Registers__OpSize) Register Mask  */


/* -------- CAM_PK_Registers__MemOffset : (CAM Offset: 0x12020) (R/W 32) Memory offset register. -------- */
#define CAM_PK_Registers__MemOffset_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_PK_Registers__MemOffset) Memory offset register.  Reset Value */

#define CAM_PK_Registers__MemOffset_MemOffset_Pos _UINT32_(0)                                          /* (CAM_PK_Registers__MemOffset) Memory offset for AHB Master Position */
#define CAM_PK_Registers__MemOffset_MemOffset_Msk (_UINT32_(0xFFFFFFFF) << CAM_PK_Registers__MemOffset_MemOffset_Pos) /* (CAM_PK_Registers__MemOffset) Memory offset for AHB Master Mask */
#define CAM_PK_Registers__MemOffset_MemOffset(value) (CAM_PK_Registers__MemOffset_MemOffset_Msk & (_UINT32_(value) << CAM_PK_Registers__MemOffset_MemOffset_Pos)) /* Assignment of value for MemOffset in the CAM_PK_Registers__MemOffset register */
#define CAM_PK_Registers__MemOffset_Msk       _UINT32_(0xFFFFFFFF)                                 /* (CAM_PK_Registers__MemOffset) Register Mask  */


/* -------- CAM_PK_Registers__MicroCodeOffset : (CAM Offset: 0x12024) (R/W 32) MicroCode offset register. -------- */
#define CAM_PK_Registers__MicroCodeOffset_RESETVALUE _UINT32_(0x00)                                       /*  (CAM_PK_Registers__MicroCodeOffset) MicroCode offset register.  Reset Value */

