Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/cam.h
#define CAM_PK_Registers__MicroCodeOffset_MicroCodeOffset_Pos _UINT32_(0)                                          /* (CAM_PK_Registers__MicroCodeOffset) MicroCode offset for AHB Master Position */
#define CAM_PK_Registers__MicroCodeOffset_MicroCodeOffset_Msk (_UINT32_(0xFFFFFFFF) << CAM_PK_Registers__MicroCodeOffset_MicroCodeOffset_Pos) /* (CAM_PK_Registers__MicroCodeOffset) MicroCode offset for AHB Master Mask */
#define CAM_PK_Registers__MicroCodeOffset_MicroCodeOffset(value) (CAM_PK_Registers__MicroCodeOffset_MicroCodeOffset_Msk & (_UINT32_(value) << CAM_PK_Registers__MicroCodeOffset_MicroCodeOffset_Pos)) /* Assignment of value for MicroCodeOffset in the CAM_PK_Registers__MicroCodeOffset register */
#define CAM_PK_Registers__MicroCodeOffset_Msk _UINT32_(0xFFFFFFFF)                                 /* (CAM_PK_Registers__MicroCodeOffset) Register Mask  */


/* CAM register offsets definitions */
#define CAM_CTRLA_REG_OFST             _UINT32_(0x00)      /* (CAM_CTRLA) Control Register A Offset */
#define CAM_STATUSA_REG_OFST           _UINT32_(0x38)      /* (CAM_STATUSA) STATUS Register A Offset */
#define CAM_SYNCBUSY_REG_OFST          _UINT32_(0x5C)      /* (CAM_SYNCBUSY) SYNCBUSY Register Offset */
#define CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_LSB_REG_OFST _UINT32_(0x10000)   /* (CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_LSB)  Offset */
#define CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_MSB_REG_OFST _UINT32_(0x10004)   /* (CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_MSB)  Offset */
#define CAM_CryptoMaster_DMA_Registers__FETCH_LEN_REG_OFST _UINT32_(0x10008)   /* (CAM_CryptoMaster_DMA_Registers__FETCH_LEN)  Offset */
#define CAM_CryptoMaster_DMA_Registers__FETCH_TAG_REG_OFST _UINT32_(0x1000C)   /* (CAM_CryptoMaster_DMA_Registers__FETCH_TAG)  Offset */
#define CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB_REG_OFST _UINT32_(0x10010)   /* (CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB)  Offset */
#define CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB_REG_OFST _UINT32_(0x10014)   /* (CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB)  Offset */
#define CAM_CryptoMaster_DMA_Registers__PUSH_LEN_REG_OFST _UINT32_(0x10018)   /* (CAM_CryptoMaster_DMA_Registers__PUSH_LEN)  Offset */
#define CAM_CryptoMaster_DMA_Registers__INT_EN_REG_OFST _UINT32_(0x1001C)   /* (CAM_CryptoMaster_DMA_Registers__INT_EN)  Offset */
#define CAM_CryptoMaster_DMA_Registers__INT_ENSET_REG_OFST _UINT32_(0x10020)   /* (CAM_CryptoMaster_DMA_Registers__INT_ENSET)  Offset */
#define CAM_CryptoMaster_DMA_Registers__INT_ENCLR_REG_OFST _UINT32_(0x10024)   /* (CAM_CryptoMaster_DMA_Registers__INT_ENCLR)  Offset */
#define CAM_CryptoMaster_DMA_Registers__INT_STATRAW_REG_OFST _UINT32_(0x10028)   /* (CAM_CryptoMaster_DMA_Registers__INT_STATRAW)  Offset */
#define CAM_CryptoMaster_DMA_Registers__INT_STAT_REG_OFST _UINT32_(0x1002C)   /* (CAM_CryptoMaster_DMA_Registers__INT_STAT)  Offset */
#define CAM_CryptoMaster_DMA_Registers__INT_STATCLR_REG_OFST _UINT32_(0x10030)   /* (CAM_CryptoMaster_DMA_Registers__INT_STATCLR)  Offset */
#define CAM_CryptoMaster_DMA_Registers__CONFIG_REG_OFST _UINT32_(0x10034)   /* (CAM_CryptoMaster_DMA_Registers__CONFIG)  Offset */
#define CAM_CryptoMaster_DMA_Registers__START_REG_OFST _UINT32_(0x10038)   /* (CAM_CryptoMaster_DMA_Registers__START)  Offset */
#define CAM_CryptoMaster_DMA_Registers__STATUS_REG_OFST _UINT32_(0x1003C)   /* (CAM_CryptoMaster_DMA_Registers__STATUS)  Offset */
#define CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG_REG_OFST _UINT32_(0x10400)   /* (CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG)  Offset */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1_REG_OFST _UINT32_(0x10404)   /* (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1)  Offset */
#define CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2_REG_OFST _UINT32_(0x10408)   /* (CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2) Generic g_CtrSize value. BA411E-AES engine configuration. Offset */
#define CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG_REG_OFST _UINT32_(0x1040C)   /* (CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG)  Offset */
#define CAM_CryptoMaster_HWConf_Registers__BA418_SHA3_HW_CFG_REG_OFST _UINT32_(0x10410)   /* (CAM_CryptoMaster_HWConf_Registers__BA418_SHA3_HW_CFG) Generic g_Sha3CtxtEn value. BA418-SHA3 configuration. Offset */
#define CAM_CryptoMaster_HWConf_Registers__BA419_SM4_HW_CFG_REG_OFST _UINT32_(0x10414)   /* (CAM_CryptoMaster_HWConf_Registers__BA419_SM4_HW_CFG) Generic g_SM4ModesPoss value. BA419-SM4 engine configuration. Offset */
#define CAM_CryptoMaster_HWConf_Registers__BA424_ARIA_HW_CFG_REG_OFST _UINT32_(0x10418)   /* (CAM_CryptoMaster_HWConf_Registers__BA424_ARIA_HW_CFG) Generic g_aria_modePoss value. BA424-Aria engine configuration. Offset */
#define CAM_RNG_Control_Registers__Control_REG_OFST _UINT32_(0x11000)   /* (CAM_RNG_Control_Registers__Control) Control register Offset */
#define CAM_RNG_Control_Registers__FIFOLevel_REG_OFST _UINT32_(0x11004)   /* (CAM_RNG_Control_Registers__FIFOLevel) FIFO level register. Offset */
#define CAM_RNG_Control_Registers__FIFOThreshold_REG_OFST _UINT32_(0x11008)   /* (CAM_RNG_Control_Registers__FIFOThreshold) FIFO threshold register. Offset */
#define CAM_RNG_Control_Registers__FIFODepth_REG_OFST _UINT32_(0x1100C)   /* (CAM_RNG_Control_Registers__FIFODepth) FIFO depth register. Offset */
#define CAM_RNG_Control_Registers__Key0_REG_OFST _UINT32_(0x11010)   /* (CAM_RNG_Control_Registers__Key0) Key register (MSB). Offset */
#define CAM_RNG_Control_Registers__Key1_REG_OFST _UINT32_(0x11014)   /* (CAM_RNG_Control_Registers__Key1) Key register. Offset */
#define CAM_RNG_Control_Registers__Key2_REG_OFST _UINT32_(0x11018)   /* (CAM_RNG_Control_Registers__Key2) Key register. Offset */
#define CAM_RNG_Control_Registers__Key3_REG_OFST _UINT32_(0x1101C)   /* (CAM_RNG_Control_Registers__Key3) Key register (LSB). Offset */
#define CAM_RNG_Control_Registers__TestData_REG_OFST _UINT32_(0x11020)   /* (CAM_RNG_Control_Registers__TestData) Test data register. Offset */
#define CAM_RNG_Control_Registers__RepeatThreshold_REG_OFST _UINT32_(0x11024)   /* (CAM_RNG_Control_Registers__RepeatThreshold) Repetition Test Count Cut-Off value. Offset */
#define CAM_RNG_Control_Registers__PropThreshold_REG_OFST _UINT32_(0x11028)   /* (CAM_RNG_Control_Registers__PropThreshold) Adaptive Proportion Test (1024-sample window) Cut-Off value. Offset */
#define CAM_RNG_Control_Registers__Status_REG_OFST _UINT32_(0x11030)   /* (CAM_RNG_Control_Registers__Status) Status register. Offset */
#define CAM_RNG_Control_Registers__InitWaitVal_REG_OFST _UINT32_(0x11034)   /* (CAM_RNG_Control_Registers__InitWaitVal) Initial wait counter value. Offset */
#define CAM_RNG_Control_Registers__DisableOsc0_REG_OFST _UINT32_(0x11038)   /* (CAM_RNG_Control_Registers__DisableOsc0) Disable oscillator rings #0 to #31. Offset */
#define CAM_RNG_Control_Registers__DisableOsc1_REG_OFST _UINT32_(0x1103C)   /* (CAM_RNG_Control_Registers__DisableOsc1) Disable oscillator rings #32 to #63. Offset */
#define CAM_RNG_Control_Registers__SwOffTmrVal_REG_OFST _UINT32_(0x11040)   /* (CAM_RNG_Control_Registers__SwOffTmrVal) Switch off timer value. Offset */
#define CAM_RNG_Control_Registers__ClkDiv_REG_OFST _UINT32_(0x11044)   /* (CAM_RNG_Control_Registers__ClkDiv) Sample clock divider. Offset */
#define CAM_RNG_Control_Registers__AIS31Conf0_REG_OFST _UINT32_(0x11048)   /* (CAM_RNG_Control_Registers__AIS31Conf0) AIS31 configuration register 0. Offset */
#define CAM_RNG_Control_Registers__AIS31Conf1_REG_OFST _UINT32_(0x1104C)   /* (CAM_RNG_Control_Registers__AIS31Conf1) AIS31 configuration register 1. Offset */
#define CAM_RNG_Control_Registers__AIS31Conf2_REG_OFST _UINT32_(0x11050)   /* (CAM_RNG_Control_Registers__AIS31Conf2) AIS31 configuration register 2. Offset */
#define CAM_RNG_Control_Registers__AIS31Status_REG_OFST _UINT32_(0x11054)   /* (CAM_RNG_Control_Registers__AIS31Status) AIS31 status register. Offset */
#define CAM_RNG_Control_Registers__HwConfig_REG_OFST _UINT32_(0x11058)   /* (CAM_RNG_Control_Registers__HwConfig) Hardware configuration register. Offset */
#define CAM_PK_Registers__Pointers_REG_OFST _UINT32_(0x12000)   /* (CAM_PK_Registers__Pointers) Pointers register. Offset */
#define CAM_PK_Registers__Command_REG_OFST _UINT32_(0x12004)   /* (CAM_PK_Registers__Command) Command register. Offset */
#define CAM_PK_Registers__Control_REG_OFST _UINT32_(0x12008)   /* (CAM_PK_Registers__Control) Command register. Offset */
#define CAM_PK_Registers__Status_REG_OFST _UINT32_(0x1200C)   /* (CAM_PK_Registers__Status) Status register. Offset */
#define CAM_PK_Registers__Timer_REG_OFST _UINT32_(0x12014)   /* (CAM_PK_Registers__Timer) Timer register. Offset */
#define CAM_PK_Registers__HwConfig_REG_OFST _UINT32_(0x12018)   /* (CAM_PK_Registers__HwConfig) Hardware configuration register. Offset */
#define CAM_PK_Registers__OpSize_REG_OFST _UINT32_(0x1201C)   /* (CAM_PK_Registers__OpSize) Operand size register. Offset */
#define CAM_PK_Registers__MemOffset_REG_OFST _UINT32_(0x12020)   /* (CAM_PK_Registers__MemOffset) Memory offset register. Offset */
#define CAM_PK_Registers__MicroCodeOffset_REG_OFST _UINT32_(0x12024)   /* (CAM_PK_Registers__MicroCodeOffset) MicroCode offset register. Offset */

