Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro/src/packs/PIC32CM5112SG00100_DFP/component/cam.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* CAM register API structure */
typedef struct
{  /* Cryptographic Acceleration Module Lite */
  __IO  uint32_t                       CAM_CTRLA;          /* Offset: 0x00 (R/W  32) Control Register A */
  __I   uint8_t                        Reserved1[0x34];
  __I   uint32_t                       CAM_STATUSA;        /* Offset: 0x38 (R/   32) STATUS Register A */
  __I   uint8_t                        Reserved2[0x20];
  __I   uint32_t                       CAM_SYNCBUSY;       /* Offset: 0x5C (R/   32) SYNCBUSY Register */
  __I   uint8_t                        Reserved3[0xFFA0];
  __IO  uint32_t                       CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_LSB; /* Offset: 0x10000 (R/W  32)  */
  __IO  uint32_t                       CAM_CryptoMaster_DMA_Registers__FETCH_ADDR_MSB; /* Offset: 0x10004 (R/W  32)  */
  __IO  uint32_t                       CAM_CryptoMaster_DMA_Registers__FETCH_LEN; /* Offset: 0x10008 (R/W  32)  */
  __IO  uint32_t                       CAM_CryptoMaster_DMA_Registers__FETCH_TAG; /* Offset: 0x1000C (R/W  32)  */
  __IO  uint32_t                       CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_LSB; /* Offset: 0x10010 (R/W  32)  */
  __IO  uint32_t                       CAM_CryptoMaster_DMA_Registers__PUSH_ADDR_MSB; /* Offset: 0x10014 (R/W  32)  */
  __IO  uint32_t                       CAM_CryptoMaster_DMA_Registers__PUSH_LEN; /* Offset: 0x10018 (R/W  32)  */
  __IO  uint32_t                       CAM_CryptoMaster_DMA_Registers__INT_EN; /* Offset: 0x1001C (R/W  32)  */
  __O   uint32_t                       CAM_CryptoMaster_DMA_Registers__INT_ENSET; /* Offset: 0x10020 ( /W  32)  */
  __O   uint32_t                       CAM_CryptoMaster_DMA_Registers__INT_ENCLR; /* Offset: 0x10024 ( /W  32)  */
  __I   uint32_t                       CAM_CryptoMaster_DMA_Registers__INT_STATRAW; /* Offset: 0x10028 (R/   32)  */
  __I   uint32_t                       CAM_CryptoMaster_DMA_Registers__INT_STAT; /* Offset: 0x1002C (R/   32)  */
  __O   uint32_t                       CAM_CryptoMaster_DMA_Registers__INT_STATCLR; /* Offset: 0x10030 ( /W  32)  */
  __IO  uint32_t                       CAM_CryptoMaster_DMA_Registers__CONFIG; /* Offset: 0x10034 (R/W  32)  */
  __O   uint32_t                       CAM_CryptoMaster_DMA_Registers__START; /* Offset: 0x10038 ( /W  32)  */
  __I   uint32_t                       CAM_CryptoMaster_DMA_Registers__STATUS; /* Offset: 0x1003C (R/   32)  */
  __I   uint8_t                        Reserved4[0x3C0];
  __I   uint32_t                       CAM_CryptoMaster_HWConf_Registers__INCL_IPS_HW_CFG; /* Offset: 0x10400 (R/   32)  */
  __I   uint32_t                       CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_1; /* Offset: 0x10404 (R/   32)  */
  __I   uint32_t                       CAM_CryptoMaster_HWConf_Registers__BA411E_AES_HW_CFG_2; /* Offset: 0x10408 (R/   32) Generic g_CtrSize value. BA411E-AES engine configuration. */
  __I   uint32_t                       CAM_CryptoMaster_HWConf_Registers__BA413_HASH_HW_CFG; /* Offset: 0x1040C (R/   32)  */
  __I   uint32_t                       CAM_CryptoMaster_HWConf_Registers__BA418_SHA3_HW_CFG; /* Offset: 0x10410 (R/   32) Generic g_Sha3CtxtEn value. BA418-SHA3 configuration. */
  __I   uint32_t                       CAM_CryptoMaster_HWConf_Registers__BA419_SM4_HW_CFG; /* Offset: 0x10414 (R/   32) Generic g_SM4ModesPoss value. BA419-SM4 engine configuration. */
  __I   uint32_t                       CAM_CryptoMaster_HWConf_Registers__BA424_ARIA_HW_CFG; /* Offset: 0x10418 (R/   32) Generic g_aria_modePoss value. BA424-Aria engine configuration. */
  __I   uint8_t                        Reserved5[0xBE4];
  __IO  uint32_t                       CAM_RNG_Control_Registers__Control; /* Offset: 0x11000 (R/W  32) Control register */
  __IO  uint32_t                       CAM_RNG_Control_Registers__FIFOLevel; /* Offset: 0x11004 (R/W  32) FIFO level register. */
  __IO  uint32_t                       CAM_RNG_Control_Registers__FIFOThreshold; /* Offset: 0x11008 (R/W  32) FIFO threshold register. */
  __I   uint32_t                       CAM_RNG_Control_Registers__FIFODepth; /* Offset: 0x1100C (R/   32) FIFO depth register. */
  __IO  uint32_t                       CAM_RNG_Control_Registers__Key0; /* Offset: 0x11010 (R/W  32) Key register (MSB). */
  __IO  uint32_t                       CAM_RNG_Control_Registers__Key1; /* Offset: 0x11014 (R/W  32) Key register. */
  __IO  uint32_t                       CAM_RNG_Control_Registers__Key2; /* Offset: 0x11018 (R/W  32) Key register. */
  __IO  uint32_t                       CAM_RNG_Control_Registers__Key3; /* Offset: 0x1101C (R/W  32) Key register (LSB). */
  __O   uint32_t                       CAM_RNG_Control_Registers__TestData; /* Offset: 0x11020 ( /W  32) Test data register. */
  __IO  uint32_t                       CAM_RNG_Control_Registers__RepeatThreshold; /* Offset: 0x11024 (R/W  32) Repetition Test Count Cut-Off value. */
  __IO  uint32_t                       CAM_RNG_Control_Registers__PropThreshold; /* Offset: 0x11028 (R/W  32) Adaptive Proportion Test (1024-sample window) Cut-Off value. */
  __I   uint8_t                        Reserved6[0x04];
  __IO  uint32_t                       CAM_RNG_Control_Registers__Status; /* Offset: 0x11030 (R/W  32) Status register. */
  __IO  uint32_t                       CAM_RNG_Control_Registers__InitWaitVal; /* Offset: 0x11034 (R/W  32) Initial wait counter value. */
  __IO  uint32_t                       CAM_RNG_Control_Registers__DisableOsc0; /* Offset: 0x11038 (R/W  32) Disable oscillator rings #0 to #31. */
  __IO  uint32_t                       CAM_RNG_Control_Registers__DisableOsc1; /* Offset: 0x1103C (R/W  32) Disable oscillator rings #32 to #63. */
  __IO  uint32_t                       CAM_RNG_Control_Registers__SwOffTmrVal; /* Offset: 0x11040 (R/W  32) Switch off timer value. */
  __IO  uint32_t                       CAM_RNG_Control_Registers__ClkDiv; /* Offset: 0x11044 (R/W  32) Sample clock divider. */
  __IO  uint32_t                       CAM_RNG_Control_Registers__AIS31Conf0; /* Offset: 0x11048 (R/W  32) AIS31 configuration register 0. */
  __IO  uint32_t                       CAM_RNG_Control_Registers__AIS31Conf1; /* Offset: 0x1104C (R/W  32) AIS31 configuration register 1. */
  __IO  uint32_t                       CAM_RNG_Control_Registers__AIS31Conf2; /* Offset: 0x11050 (R/W  32) AIS31 configuration register 2. */
  __IO  uint32_t                       CAM_RNG_Control_Registers__AIS31Status; /* Offset: 0x11054 (R/W  32) AIS31 status register. */
  __I   uint32_t                       CAM_RNG_Control_Registers__HwConfig; /* Offset: 0x11058 (R/   32) Hardware configuration register. */
  __I   uint8_t                        Reserved7[0xFA4];
  __IO  uint32_t                       CAM_PK_Registers__Pointers; /* Offset: 0x12000 (R/W  32) Pointers register. */
  __IO  uint32_t                       CAM_PK_Registers__Command; /* Offset: 0x12004 (R/W  32) Command register. */
  __O   uint32_t                       CAM_PK_Registers__Control; /* Offset: 0x12008 ( /W  32) Command register. */
  __I   uint32_t                       CAM_PK_Registers__Status; /* Offset: 0x1200C (R/   32) Status register. */
  __I   uint8_t                        Reserved8[0x04];
  __IO  uint32_t                       CAM_PK_Registers__Timer; /* Offset: 0x12014 (R/W  32) Timer register. */
  __I   uint32_t                       CAM_PK_Registers__HwConfig; /* Offset: 0x12018 (R/   32) Hardware configuration register. */
  __IO  uint32_t                       CAM_PK_Registers__OpSize; /* Offset: 0x1201C (R/W  32) Operand size register. */
  __IO  uint32_t                       CAM_PK_Registers__MemOffset; /* Offset: 0x12020 (R/W  32) Memory offset register. */
  __IO  uint32_t                       CAM_PK_Registers__MicroCodeOffset; /* Offset: 0x12024 (R/W  32) MicroCode offset register. */
} cam_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMSG00_CAM_COMPONENT_H_ */
